{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|pad|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|bos|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<|eos|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<|unk|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<|im_start|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<|im_end|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "<|system|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 7,
      "content": "<|user|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 8,
      "content": "<|assistant|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 9,
      "content": "<|think|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10,
      "content": "<|/think|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 11,
      "content": "<|answer|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 12,
      "content": "<|/answer|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 13,
      "content": "<|tool_call|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 14,
      "content": "<|/tool_call|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 15,
      "content": "<|tool_result|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 16,
      "content": "<|/tool_result|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 17,
      "content": "<|image|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 18,
      "content": "<|/image|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 19,
      "content": "<|patch|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 20,
      "content": "<|fim_prefix|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 21,
      "content": "<|fim_middle|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 22,
      "content": "<|fim_suffix|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 23,
      "content": "<|alpha|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 24,
      "content": "<|beta|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 25,
      "content": "<|reserved_0|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 26,
      "content": "<|reserved_1|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 27,
      "content": "<|reserved_2|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 28,
      "content": "<|reserved_3|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 29,
      "content": "<|reserved_4|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 30,
      "content": "<|reserved_5|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 31,
      "content": "<|reserved_6|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "NFC"
  },
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Split",
        "pattern": {
          "Regex": "(?i:'s|'t|'re|'ve|'m|'ll|'d)|[^\\r\\n\\p{L}\\p{N}]?+\\p{L}+|\\p{N}{1,3}| ?[^\\s\\p{L}\\p{N}]++[\\r\\n]*|\\s*[\\r\\n]|\\s+(?!\\S)|\\s+"
        },
        "behavior": "Isolated",
        "invert": false
      },
      {
        "type": "ByteLevel",
        "add_prefix_space": false,
        "trim_offsets": true,
        "use_regex": false
      }
    ]
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<|unk|>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|pad|>": 0,
      "<|bos|>": 1,
      "<|eos|>": 2,
      "<|unk|>": 3,
      "<|im_start|>": 4,
      "<|im_end|>": 5,
      "<|system|>": 6,
      "<|user|>": 7,
      "<|assistant|>": 8,
      "<|think|>": 9,
      "<|/think|>": 10,
      "<|answer|>": 11,
      "<|/answer|>": 12,
      "<|tool_call|>": 13,
      "<|/tool_call|>": 14,
      "<|tool_result|>": 15,
      "<|/tool_result|>": 16,
      "<|image|>": 17,
      "<|/image|>": 18,
      "<|patch|>": 19,
      "<|fim_prefix|>": 20,
      "<|fim_middle|>": 21,
      "<|fim_suffix|>": 22,
      "<|alpha|>": 23,
      "<|beta|>": 24,
      "<|reserved_0|>": 25,
      "<|reserved_1|>": 26,
      "<|reserved_2|>": 27,
      "<|reserved_3|>": 28,
      "<|reserved_4|>": 29,
      "<|reserved_5|>": 30,
      "<|reserved_6|>": 31,
      "!": 32,
      "\"": 33,
      "#": 34,
      "$": 35,
      "%": 36,
      "&": 37,
      "'": 38,
      "(": 39,
      ")": 40,
      "*": 41,
      "+": 42,
      ",": 43,
      "-": 44,
      ".": 45,
      "/": 46,
      "0": 47,
      "1": 48,
      "2": 49,
      "3": 50,
      "4": 51,
      "5": 52,
      "6": 53,
      "7": 54,
      "8": 55,
      "9": 56,
      ":": 57,
      ";": 58,
      "<": 59,
      "=": 60,
      ">": 61,
      "?": 62,
      "@": 63,
      "A": 64,
      "B": 65,
      "C": 66,
      "D": 67,
      "E": 68,
      "F": 69,
      "G": 70,
      "H": 71,
      "I": 72,
      "J": 73,
      "K": 74,
      "L": 75,
      "M": 76,
      "N": 77,
      "O": 78,
      "P": 79,
      "Q": 80,
      "R": 81,
      "S": 82,
      "T": 83,
      "U": 84,
      "V": 85,
      "W": 86,
      "X": 87,
      "Y": 88,
      "Z": 89,
      "[": 90,
      "\\": 91,
      "]": 92,
      "^": 93,
      "_": 94,
      "`": 95,
      "a": 96,
      "b": 97,
      "c": 98,
      "d": 99,
      "e": 100,
      "f": 101,
      "g": 102,
      "h": 103,
      "i": 104,
      "j": 105,
      "k": 106,
      "l": 107,
      "m": 108,
      "n": 109,
      "o": 110,
      "p": 111,
      "q": 112,
      "r": 113,
      "s": 114,
      "t": 115,
      "u": 116,
      "v": 117,
      "w": 118,
      "x": 119,
      "y": 120,
      "z": 121,
      "{": 122,
      "|": 123,
      "}": 124,
      "~": 125,
      "¡": 126,
      "¢": 127,
      "£": 128,
      "¤": 129,
      "¥": 130,
      "¦": 131,
      "§": 132,
      "¨": 133,
      "©": 134,
      "ª": 135,
      "«": 136,
      "¬": 137,
      "®": 138,
      "¯": 139,
      "°": 140,
      "±": 141,
      "²": 142,
      "³": 143,
      "´": 144,
      "µ": 145,
      "¶": 146,
      "·": 147,
      "¸": 148,
      "¹": 149,
      "º": 150,
      "»": 151,
      "¼": 152,
      "½": 153,
      "¾": 154,
      "¿": 155,
      "À": 156,
      "Á": 157,
      "Â": 158,
      "Ã": 159,
      "Ä": 160,
      "Å": 161,
      "Æ": 162,
      "Ç": 163,
      "È": 164,
      "É": 165,
      "Ê": 166,
      "Ë": 167,
      "Ì": 168,
      "Í": 169,
      "Î": 170,
      "Ï": 171,
      "Ð": 172,
      "Ñ": 173,
      "Ò": 174,
      "Ó": 175,
      "Ô": 176,
      "Õ": 177,
      "Ö": 178,
      "×": 179,
      "Ø": 180,
      "Ù": 181,
      "Ú": 182,
      "Û": 183,
      "Ü": 184,
      "Ý": 185,
      "Þ": 186,
      "ß": 187,
      "à": 188,
      "á": 189,
      "â": 190,
      "ã": 191,
      "ä": 192,
      "å": 193,
      "æ": 194,
      "ç": 195,
      "è": 196,
      "é": 197,
      "ê": 198,
      "ë": 199,
      "ì": 200,
      "í": 201,
      "î": 202,
      "ï": 203,
      "ð": 204,
      "ñ": 205,
      "ò": 206,
      "ó": 207,
      "ô": 208,
      "õ": 209,
      "ö": 210,
      "÷": 211,
      "ø": 212,
      "ù": 213,
      "ú": 214,
      "û": 215,
      "ü": 216,
      "ý": 217,
      "þ": 218,
      "ÿ": 219,
      "Ā": 220,
      "ā": 221,
      "Ă": 222,
      "ă": 223,
      "Ą": 224,
      "ą": 225,
      "Ć": 226,
      "ć": 227,
      "Ĉ": 228,
      "ĉ": 229,
      "Ċ": 230,
      "ċ": 231,
      "Č": 232,
      "č": 233,
      "Ď": 234,
      "ď": 235,
      "Đ": 236,
      "đ": 237,
      "Ē": 238,
      "ē": 239,
      "Ĕ": 240,
      "ĕ": 241,
      "Ė": 242,
      "ė": 243,
      "Ę": 244,
      "ę": 245,
      "Ě": 246,
      "ě": 247,
      "Ĝ": 248,
      "ĝ": 249,
      "Ğ": 250,
      "ğ": 251,
      "Ġ": 252,
      "ġ": 253,
      "Ģ": 254,
      "ģ": 255,
      "Ĥ": 256,
      "ĥ": 257,
      "Ħ": 258,
      "ħ": 259,
      "Ĩ": 260,
      "ĩ": 261,
      "Ī": 262,
      "ī": 263,
      "Ĭ": 264,
      "ĭ": 265,
      "Į": 266,
      "į": 267,
      "İ": 268,
      "ı": 269,
      "Ĳ": 270,
      "ĳ": 271,
      "Ĵ": 272,
      "ĵ": 273,
      "Ķ": 274,
      "ķ": 275,
      "ĸ": 276,
      "Ĺ": 277,
      "ĺ": 278,
      "Ļ": 279,
      "ļ": 280,
      "Ľ": 281,
      "ľ": 282,
      "Ŀ": 283,
      "ŀ": 284,
      "Ł": 285,
      "ł": 286,
      "Ń": 287,
      "Ġt": 288,
      "ĠĠ": 289,
      "Ġa": 290,
      "in": 291,
      "he": 292,
      "on": 293,
      "re": 294,
      "er": 295,
      "Ġs": 296,
      "at": 297,
      "Ġthe": 298,
      "Ġc": 299,
      "or": 300,
      "en": 301,
      "is": 302,
      "al": 303,
      "Ġf": 304,
      "es": 305,
      "it": 306,
      "Ġp": 307,
      "an": 308,
      "Ġ=": 309,
      "Ġw": 310,
      "ĠĠĠĠ": 311,
      "Ġb": 312,
      "Ġo": 313,
      "ion": 314,
      "Ġ(": 315,
      "Ġm": 316,
      "ed": 317,
      "Ġan": 318,
      "ar": 319,
      "Ġd": 320,
      "ing": 321,
      "le": 322,
      "Ġin": 323,
      "ro": 324,
      "ct": 325,
      "ĊĊ": 326,
      "Ġof": 327,
      "Ġto": 328,
      "ic": 329,
      "Ġn": 330,
      "Ġ-": 331,
      "ut": 332,
      "Ġis": 333,
      "us": 334,
      "Ġe": 335,
      "ent": 336,
      "Ġand": 337,
      "ĠS": 338,
      "et": 339,
      "as": 340,
      "Ġth": 341,
      "Ġre": 342,
      "ve": 343,
      "om": 344,
      "ly": 345,
      "Ġl": 346,
      "Ġ+": 347,
      "im": 348,
      "Ġh": 349,
      "ou": 350,
      "ĠT": 351,
      ".ĊĊ": 352,
      "ĠA": 353,
      "ot": 354,
      "ra": 355,
      "id": 356,
      "ation": 357,
      "st": 358,
      "ol": 359,
      "Ġfor": 360,
      "ĠĠĠ": 361,
      "ce": 362,
      "ig": 363,
      "Ġg": 364,
      "**": 365,
      "il": 366,
      "ow": 367,
      "qu": 368,
      "Ġbe": 369,
      "Ġ\\": 370,
      "Ġwe": 371,
      "if": 372,
      "Ġâ": 373,
      "Ġcon": 374,
      "ch": 375,
      "um": 376,
      "os": 377,
      "ul": 378,
      "ĠI": 379,
      "Ġthat": 380,
      "ĠC": 381,
      "ver": 382,
      ").": 383,
      "el": 384,
      "Ġy": 385,
      "ĠSo": 386,
      "un": 387,
      "ur": 388,
      "ĠĠĠĠĠĠĠĠ": 389,
      "ith": 390,
      "ĠB": 391,
      "Ġon": 392,
      "Ġst": 393,
      "ĠThe": 394,
      ".Ċ": 395,
      "ir": 396,
      "am": 397,
      "--": 398,
      "Ġpro": 399,
      "ter": 400,
      "ĠL": 401,
      "Ġex": 402,
      "od": 403,
      "Ġwith": 404,
      "Ġx": 405,
      "Ġ$": 406,
      "Ġor": 407,
      "ay": 408,
      "Ġv": 409,
      "res": 410,
      "ate": 411,
      "ive": 412,
      "Ġas": 413,
      "ist": 414,
      "ag": 415,
      "'s": 416,
      "Ġr": 417,
      "te": 418,
      "Ġal": 419,
      "se": 420,
      "Ġne": 421,
      "Ġare": 422,
      "ri": 423,
      "ĠM": 424,
      "00": 425,
      "Ġcan": 426,
      "ction": 427,
      "Ġat": 428,
      "ĠP": 429,
      "ad": 430,
      "igh": 431,
      ":Ċ": 432,
      "Ġ\"": 433,
      "ity": 434,
      "Ġcom": 435,
      "pe": 436,
      "th": 437,
      "Ġit": 438,
      "ble": 439,
      "iv": 440,
      "ally": 441,
      "ts": 442,
      ")Ċ": 443,
      "Ġk": 444,
      "ĠR": 445,
      "rom": 446,
      "ĠF": 447,
      "ers": 448,
      "Ġnot": 449,
      "Ġwh": 450,
      "Ġde": 451,
      "ĠĠĠĠĠĠĠ": 452,
      "ment": 453,
      "Ġâī": 454,
      "ang": 455,
      "end": 456,
      "ine": 457,
      "ess": 458,
      "pp": 459,
      "Ġus": 460,
      "her": 461,
      "ave": 462,
      "ight": 463,
      "ĠD": 464,
      "oun": 465,
      "ck": 466,
      "and": 467,
      "ld": 468,
      "Ġby": 469,
      "Ġsu": 470,
      "==": 471,
      "ĠE": 472,
      "est": 473,
      "ĠN": 474,
      "lo": 475,
      "Ġfrom": 476,
      "Ġse": 477,
      "art": 478,
      "Ġ**": 479,
      "ĠH": 480,
      "^{": 481,
      "ant": 482,
      "ain": 483,
      "pt": 484,
      "(x": 485,
      "Ġch": 486,
      "ĠÎ": 487,
      "ĠW": 488,
      "Th": 489,
      "Ġhave": 490,
      "de": 491,
      "all": 492,
      "Ġcomp": 493,
      "ore": 494,
      "),": 495,
      "ies": 496,
      "âĢ": 497,
      "Ġle": 498,
      "ĠO": 499,
      "ren": 500,
      "ctu": 501,
      "Ġif": 502,
      "ould": 503,
      "pl": 504,
      "em": 505,
      "iz": 506,
      "ab": 507,
      "ust": 508,
      "rt": 509,
      "<|": 510,
      "|>": 511,
      "Ġhe": 512,
      "act": 513,
      "ass": 514,
      "Ġun": 515,
      "up": 516,
      "Thus": 517,
      "ide": 518,
      "Ġsh": 519,
      "ke": 520,
      "ach": 521,
      "Ġ|": 522,
      "fe": 523,
      "----": 524,
      "Ġneed": 525,
      "ial": 526,
      "Ġpo": 527,
      "per": 528,
      "ition": 529,
      "ĠTh": 530,
      "ĠIn": 531,
      "ans": 532,
      "int": 533,
      "Ġ*": 534,
      "qrt": 535,
      "ac": 536,
      "ich": 537,
      "bo": 538,
      "ds": 539,
      "ase": 540,
      "der": 541,
      ")^": 542,
      "ĠG": 543,
      "_{": 544,
      "cl": 545,
      "xt": 546,
      "ap": 547,
      "Ġthis": 548,
      "ge": 549,
      "ĠLet": 550,
      "Ġbut": 551,
      "ple": 552,
      "Ġme": 553,
      "Ġdi": 554,
      "ill": 555,
      "ult": 556,
      "Ġwhe": 557,
      "ort": 558,
      "Ġ/": 559,
      "red": 560,
      "ue": 561,
      "ical": 562,
      "ome": 563,
      "ution": 564,
      "Ġper": 565,
      "our": 566,
      "og": 567,
      "Ġim": 568,
      "Ġ'": 569,
      "10": 570,
      "..": 571,
      "age": 572,
      "Ġtr": 573,
      "rac": 574,
      "wer": 575,
      "so": 576,
      "ative": 577,
      "orm": 578,
      "The": 579,
      "âĪ": 580,
      "Ġall": 581,
      "Ġnum": 582,
      "gh": 583,
      "}{": 584,
      "ĠU": 585,
      "``": 586,
      "erm": 587,
      "ame": 588,
      "frac": 589,
      "ated": 590,
      "ĠBut": 591,
      "Ġthey": 592,
      "ince": 593,
      "Ġres": 594,
      "Ġwhich": 595,
      "19": 596,
      "du": 597,
      ")/": 598,
      "ctually": 599,
      "are": 600,
      "be": 601,
      "Ġsol": 602,
      "ations": 603,
      "Ġso": 604,
      "to": 605,
      "20": 606,
      "ute": 607,
      "ure": 608,
      "Ġfin": 609,
      "Ġad": 610,
      ":ĊĊ": 611,
      "ĠĠĠĠĠĠĠĠĠĠĠ": 612,
      "ite": 613,
      "ip": 614,
      "ud": 615,
      "Ġsqrt": 616,
      "Ġcont": 617,
      "Ġinter": 618,
      "ens": 619,
      "Ġmod": 620,
      "Ġmay": 621,
      "ther": 622,
      "ft": 623,
      "ÏĢ": 624,
      "ary": 625,
      "Ġ`": 626,
      "====": 627,
      "Ġany": 628,
      "Ġinte": 629,
      "Ġline": 630,
      "ph": 631,
      "Ġ=>": 632,
      "Ġpos": 633,
      "Ġequ": 634,
      "##": 635,
      "Ġro": 636,
      "Ġtw": 637,
      "25": 638,
      "elf": 639,
      "Ġhas": 640,
      "ger": 641,
      "Ġver": 642,
      "ound": 643,
      "ink": 644,
      "ĠâĪ": 645,
      "Ġpl": 646,
      "Ġdo": 647,
      "Ġsin": 648,
      "ific": 649,
      "ll": 650,
      "con": 651,
      "ost": 652,
      "ber": 653,
      "Ġsqu": 654,
      "Ġar": 655,
      "cc": 656,
      "Ġyou": 657,
      "ard": 658,
      "ect": 659,
      "Ġ>": 660,
      "12": 661,
      "ep": 662,
      "Ġqu": 663,
      "ru": 664,
      "|>Ċ": 665,
      "ath": 666,
      "Ġreg": 667,
      "ĠActually": 668,
      "urn": 669,
      "ence": 670,
      "ates": 671,
      "ance": 672,
      "ator": 673,
      "Ġcl": 674,
      "Ġli": 675,
      "Ġeach": 676,
      "swer": 677,
      "dition": 678,
      "ime": 679,
      "Ġapp": 680,
      "Ġma": 681,
      "able": 682,
      "Ġabo": 683,
      "Ġfun": 684,
      "Ġ[": 685,
      "Ġexp": 686,
      "Ġalso": 687,
      "Ġ$\\": 688,
      "Ġtwo": 689,
      "))": 690,
      "Ġen": 691,
      "irc": 692,
      "Ġspe": 693,
      "ork": 694,
      "Ġwas": 695,
      "ents": 696,
      "aus": 697,
      "ous": 698,
      "ress": 699,
      "Ġ{": 700,
      "Ġform": 701,
      "Ġu": 702,
      "Ġthere": 703,
      "ints": 704,
      "ĠFor": 705,
      "ular": 706,
      "eth": 707,
      "11": 708,
      "Ġout": 709,
      "rent": 710,
      "ĠK": 711,
      "Ġ\\(": 712,
      "tern": 713,
      "Ġmat": 714,
      "own": 715,
      "Ġthen": 716,
      "form": 717,
      "Ġanswer": 718,
      "Ġone": 719,
      "Ġcos": 720,
      "ast": 721,
      "ile": 722,
      "Ġval": 723,
      "ĠâīĪ": 724,
      "Ġcol": 725,
      "ount": 726,
      "ew": 727,
      "ign": 728,
      "blem": 729,
      "Ġbec": 730,
      "Ġwhere": 731,
      "rect": 732,
      "one": 733,
      "ose": 734,
      "Ġsum": 735,
      "Ġconst": 736,
      "ari": 737,
      "/(": 738,
      "Ġ#": 739,
      "ack": 740,
      "18": 741,
      "text": 742,
      "Ġpart": 743,
      "ugh": 744,
      "iel": 745,
      "Ġsome": 746,
      "low": 747,
      "Ġmust": 748,
      "ram": 749,
      "Ġother": 750,
      "ĠY": 751,
      "Ġsolution": 752,
      "ace": 753,
      "ĠThis": 754,
      "Ġcons": 755,
      "}$": 756,
      "put": 757,
      "Ġj": 758,
      "we": 759,
      "Ġpr": 760,
      "ff": 761,
      "Ġgo": 762,
      "Ġco": 763,
      "Ġev": 764,
      "ild": 765,
      "Ġret": 766,
      "Ġabout": 767,
      "Ġmore": 768,
      "ĠJ": 769,
      "Ġfunction": 770,
      "itive": 771,
      "ice": 772,
      "Ġz": 773,
      "Ġlo": 774,
      "Ġdist": 775,
      "Now": 776,
      "ces": 777,
      "âĪļ": 778,
      "the": 779,
      "ree": 780,
      "Ġproblem": 781,
      "15": 782,
      "43": 783,
      "16": 784,
      "Ġdis": 785,
      "agon": 786,
      "Ġsc": 787,
      "Ġterm": 788,
      "oth": 789,
      "_i": 790,
      "Ġbet": 791,
      "av": 792,
      "Ġdef": 793,
      "ĠV": 794,
      "angle": 795,
      "âĢĻ": 796,
      "(y": 797,
      "Ġsuch": 798,
      "_st": 799,
      "rough": 800,
      "ord": 801,
      "ong": 802,
      "\"Ċ": 803,
      "ak": 804,
      "Ġup": 805,
      "si": 806,
      "Ġsp": 807,
      "13": 808,
      "ry": 809,
      ".,": 810,
      "Ġtri": 811,
      "Ġspec": 812,
      "ĠThen": 813,
      "ption": 814,
      "',": 815,
      "cy": 816,
      "ok": 817,
      "ors": 818,
      "ĠĊ": 819,
      "Ġkn": 820,
      "Ġsy": 821,
      "Ġq": 822,
      "irst": 823,
      "ory": 824,
      "ia": 825,
      "Ġno": 826,
      "port": 827,
      "Ġinteger": 828,
      "Ġgro": 829,
      "Ġreturn": 830,
      "Ġ<": 831,
      "Ġthrough": 832,
      "Ġcirc": 833,
      "pend": 834,
      "ause": 835,
      "heck": 836,
      "000": 837,
      "Ġdif": 838,
      "**:": 839,
      "Ġtheir": 840,
      "14": 841,
      "Ġright": 842,
      "cess": 843,
      "Ġsm": 844,
      "Ġte": 845,
      "ata": 846,
      "Ġsub": 847,
      "Ġlike": 848,
      "li": 849,
      "Ġcondition": 850,
      "Ġits": 851,
      "$$": 852,
      "--------": 853,
      "Ġwill": 854,
      "Ġph": 855,
      "Ġonly": 856,
      "ĠSt": 857,
      "ject": 858,
      "ys": 859,
      "ween": 860,
      "```": 861,
      "les": 862,
      "Ġuse": 863,
      "âĶ": 864,
      "Ġra": 865,
      "Ġthan": 866,
      "_start": 867,
      "Ġover": 868,
      "ares": 869,
      "Ġâī¤": 870,
      "ality": 871,
      "_end": 872,
      "Â°": 873,
      "Ġpre": 874,
      "Ġbetween": 875,
      "Ġmaybe": 876,
      "eng": 877,
      "ĠAn": 878,
      "Ġwould": 879,
      "Ġman": 880,
      "ne": 881,
      "Ġinc": 882,
      "ract": 883,
      "Ġtang": 884,
      "ĠIf": 885,
      "ail": 886,
      "Ġrec": 887,
      "ĠAB": 888,
      "Ġusing": 889,
      "We": 890,
      "_n": 891,
      "ub": 892,
      "Ġshould": 893,
      "Ġsquares": 894,
      "Ġrequ": 895,
      "ments": 896,
      "di": 897,
      "als": 898,
      "Ġnumber": 899,
      "Ġsmall": 900,
      "Ġset": 901,
      "Ġleft": 902,
      "ĠĠĠĠĊ": 903,
      "Ġnon": 904,
      "ĠSince": 905,
      "Ġprov": 906,
      "ars": 907,
      "Ġcompute": 908,
      "Ġfind": 909,
      "fect": 910,
      "ring": 911,
      "ating": 912,
      "ify": 913,
      "Let": 914,
      "out": 915,
      "Ġcent": 916,
      "ays": 917,
      "Ġpoint": 918,
      "ric": 919,
      "imes": 920,
      "Ġdiv": 921,
      "Ġ}": 922,
      "Ġgiv": 923,
      "op": 924,
      "36": 925,
      "But": 926,
      "Ġsim": 927,
      "ize": 928,
      "_A": 929,
      "ise": 930,
      "ues": 931,
      "Ġbound": 932,
      "Ġang": 933,
      "Ġi": 934,
      "Ġprodu": 935,
      "ines": 936,
      "ener": 937,
      "Ġcomm": 938,
      "Ġinto": 939,
      "Ġappro": 940,
      "Ġwork": 941,
      "ell": 942,
      "ty": 943,
      "rib": 944,
      "ci": 945,
      "resent": 946,
      "Ġregion": 947,
      "ĠÎ±": 948,
      "Ġâī¥": 949,
      "ength": 950,
      "In": 951,
      "ited": 952,
      "ĠThat": 953,
      "Ġincl": 954,
      "owe": 955,
      "ĠX": 956,
      ":**": 957,
      "hed": 958,
      "vers": 959,
      "Ġchar": 960,
      "âĶĢ": 961,
      "ful": 962,
      "Ġdes": 963,
      "bers": 964,
      "ĠâĢ": 965,
      "erv": 966,
      "Ġdiffe": 967,
      "ron": 968,
      "Ġpa": 969,
      "Ġdiagon": 970,
      "Ġtra": 971,
      "aps": 972,
      "ec": 973,
      "Ġfirst": 974,
      "Ġtrans": 975,
      "Ġfact": 976,
      "Ġmin": 977,
      "Ġpar": 978,
      "ta": 979,
      "Ġcor": 980,
      "Ġboth": 981,
      "ĠÏ": 982,
      "Ġcould": 983,
      "hes": 984,
      "Ġty": 985,
      "Ġsame": 986,
      "equ": 987,
      "ĠCon": 988,
      "Ġaf": 989,
      "ational": 990,
      "Ġpositive": 991,
      "ider": 992,
      "ma": 993,
      "========": 994,
      "Ġrel": 995,
      "und": 996,
      "(f": 997,
      "Ġlar": 998,
      ",Ċ": 999,
      "ian": 1000,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1001,
      "âĢĻs": 1002,
      "Ġself": 1003,
      "ions": 1004,
      "Ġget": 1005,
      "its": 1006,
      "gative": 1007,
      ")=": 1008,
      "pect": 1009,
      "app": 1010,
      "):Ċ": 1011,
      "Ġrep": 1012,
      "(-": 1013,
      "cos": 1014,
      "...": 1015,
      "ething": 1016,
      "not": 1017,
      "Ġele": 1018,
      "Ġexam": 1019,
      "ides": 1020,
      "Ġrem": 1021,
      "omp": 1022,
      "ait": 1023,
      "Ġtry": 1024,
      "tal": 1025,
      "Ġthem": 1026,
      "Ġinde": 1027,
      "omething": 1028,
      "igin": 1029,
      "Ġpoints": 1030,
      "gy": 1031,
      "Ġorder": 1032,
      "cal": 1033,
      "Ġwhen": 1034,
      "Ġdoes": 1035,
      "âĶĢâĶĢ": 1036,
      "Ġtime": 1037,
      "io": 1038,
      "$,": 1039,
      "Ġcircle": 1040,
      "Ġcheck": 1041,
      "ient": 1042,
      "xed": 1043,
      "}\\": 1044,
      "ency": 1045,
      "yth": 1046,
      "Ġacc": 1047,
      "Ġchild": 1048,
      "Ġbecause": 1049,
      "'t": 1050,
      "^{-": 1051,
      "Ġunder": 1052,
      "ility": 1053,
      "ices": 1054,
      "Ġdiagonal": 1055,
      "Ġlength": 1056,
      "17": 1057,
      "Ġspecific": 1058,
      "200": 1059,
      "ĠUn": 1060,
      "ind": 1061,
      "Ġstate": 1062,
      "owever": 1063,
      ").ĊĊ": 1064,
      "Ġob": 1065,
      "ror": 1066,
      "Ġmight": 1067,
      "ire": 1068,
      "Ġwhat": 1069,
      "Ġangle": 1070,
      "Ġext": 1071,
      "ĠIt": 1072,
      "ics": 1073,
      "Ġag": 1074,
      "dd": 1075,
      "ÃĹ": 1076,
      "ough": 1077,
      "val": 1078,
      "ields": 1079,
      "xim": 1080,
      "__": 1081,
      "Ġthese": 1082,
      "arly": 1083,
      "get": 1084,
      "rit": 1085,
      "reat": 1086,
      "Ġins": 1087,
      "user": 1088,
      "ick": 1089,
      "Ġinterse": 1090,
      "ey": 1091,
      "olog": 1092,
      "ident": 1093,
      "Ġtriangle": 1094,
      "Ġflo": 1095,
      "fore": 1096,
      "Ġgroup": 1097,
      "ner": 1098,
      "Ġed": 1099,
      "Ġnumbers": 1100,
      "stem": 1101,
      "ĠCh": 1102,
      "Ġâī¡": 1103,
      ")ĊĊ": 1104,
      "ish": 1105,
      "ities": 1106,
      "Ġstud": 1107,
      "45": 1108,
      "Ġdet": 1109,
      "Ġden": 1110,
      "ures": 1111,
      "Ġac": 1112,
      "Ġcur": 1113,
      "cture": 1114,
      "sqrt": 1115,
      "Ġab": 1116,
      "Ġwere": 1117,
      "think": 1118,
      "Ġadd": 1119,
      "onent": 1120,
      ".e": 1121,
      "ert": 1122,
      "+y": 1123,
      "Ġass": 1124,
      "sible": 1125,
      "ero": 1126,
      "]Ċ": 1127,
      "Ġem": 1128,
      "Ġfinal": 1129,
      "(t": 1130,
      "ically": 1131,
      "Ġorigin": 1132,
      "self": 1133,
      "ode": 1134,
      "math": 1135,
      "raph": 1136,
      "cul": 1137,
      "Al": 1138,
      "Ġmult": 1139,
      "Ġstep": 1140,
      "iss": 1141,
      "since": 1142,
      "ange": 1143,
      "Ġtangent": 1144,
      "Ġeven": 1145,
      "omin": 1146,
      "Ġvari": 1147,
      "Ġcomple": 1148,
      "hen": 1149,
      "Ġsomething": 1150,
      "Ġside": 1151,
      "velo": 1152,
      "Ġcre": 1153,
      "ython": 1154,
      "Ġafter": 1155,
      "ĠQ": 1156,
      "Ġel": 1157,
      "ature": 1158,
      "ĠAl": 1159,
      "Ġdifferent": 1160,
      "*(": 1161,
      "sin": 1162,
      "Ġuser": 1163,
      "ss": 1164,
      "ĠHowever": 1165,
      "Ġrat": 1166,
      "Ġwho": 1167,
      "Ġhol": 1168,
      "Ġyour": 1169,
      "Ġconsider": 1170,
      "vi": 1171,
      "Ġexpress": 1172,
      "pro": 1173,
      "ude": 1174,
      "_c": 1175,
      "Ġhad": 1176,
      "28": 1177,
      "ume": 1178,
      "Ġnew": 1179,
      "cd": 1180,
      "Ġsquare": 1181,
      "ined": 1182,
      "right": 1183,
      ")^{": 1184,
      "ood": 1185,
      "Ġ(-": 1186,
      "[Ċ": 1187,
      "{\\": 1188,
      "ctions": 1189,
      "Ġmodel": 1190,
      "Ġsat": 1191,
      "formation": 1192,
      "30": 1193,
      "Ġam": 1194,
      "row": 1195,
      "ĠAC": 1196,
      "Ġexist": 1197,
      "âĢĿ": 1198,
      "Ġjust": 1199,
      "Ġnegative": 1200,
      "Ġinv": 1201,
      "Ġinequ": 1202,
      "Ġgener": 1203,
      "mod": 1204,
      "Ġsee": 1205,
      "_t": 1206,
      "Ġhow": 1207,
      "Ġfloor": 1208,
      "ĠWe": 1209,
      "47": 1210,
      "Ġmost": 1211,
      "22": 1212,
      "ĠPro": 1213,
      "Ġinst": 1214,
      ").Ċ": 1215,
      "pon": 1216,
      "ethod": 1217,
      "Ġfe": 1218,
      "26": 1219,
      "arch": 1220,
      "Ġpass": 1221,
      "Ġgiven": 1222,
      "Ġmo": 1223,
      "Ġterms": 1224,
      "Ġknown": 1225,
      "Ġrepresent": 1226,
      "Ġdata": 1227,
      "Ġhis": 1228,
      "Ġ\"\"": 1229,
      "Ġvis": 1230,
      "Ġequation": 1231,
      "Ġclass": 1232,
      "cond": 1233,
      "ention": 1234,
      "ield": 1235,
      "Ġsystem": 1236,
      ")$": 1237,
      "mer": 1238,
      "po": 1239,
      "ower": 1240,
      "(\\": 1241,
      "ef": 1242,
      "isf": 1243,
      "Ġoper": 1244,
      "Ġresult": 1245,
      "Ġinequality": 1246,
      "alcul": 1247,
      "Ġbo": 1248,
      "icular": 1249,
      "Ġused": 1250,
      "ĨĴ": 1251,
      "_B": 1252,
      "istant": 1253,
      "ages": 1254,
      "ĠĠĠĠĠĠĠĠĊ": 1255,
      "Ġend": 1256,
      "Ġsatisf": 1257,
      "itt": 1258,
      "Ġinclud": 1259,
      "rite": 1260,
      "Ġtotal": 1261,
      "ases": 1262,
      "erson": 1263,
      "Ġdirect": 1264,
      "ĠâĦ": 1265,
      "Ġvol": 1266,
      "lic": 1267,
      "Ġwant": 1268,
      "ants": 1269,
      "Ġband": 1270,
      "ased": 1271,
      "Ġquest": 1272,
      "ĠEx": 1273,
      "Ġexact": 1274,
      "ĠÃĹ": 1275,
      "Ġthink": 1276,
      "Ġcase": 1277,
      "Ġvalue": 1278,
      "ved": 1279,
      "Ġconstra": 1280,
      "Ġpe": 1281,
      "ced": 1282,
      "ization": 1283,
      "Ġ|Ċ": 1284,
      "answer": 1285,
      "Ġbeen": 1286,
      "Ġimport": 1287,
      "Ġmany": 1288,
      "33": 1289,
      "rence": 1290,
      "ominator": 1291,
      "plic": 1292,
      "ternative": 1293,
      "(p": 1294,
      "ake": 1295,
      "ffic": 1296,
      "here": 1297,
      "Ġcannot": 1298,
      "Ġpat": 1299,
      "aw": 1300,
      "ĠRe": 1301,
      "24": 1302,
      "Ġtest": 1303,
      "Ġye": 1304,
      "cdot": 1305,
      "ges": 1306,
      "ning": 1307,
      "ĠBC": 1308,
      "Ġproper": 1309,
      "Ġsign": 1310,
      "Ġhand": 1311,
      "60": 1312,
      "ex": 1313,
      "Ġsur": 1314,
      "Ġhel": 1315,
      "read": 1316,
      ".\"": 1317,
      "ism": 1318,
      "HS": 1319,
      "St": 1320,
      "par": 1321,
      "ized": 1322,
      "Ġvalues": 1323,
      "gram": 1324,
      "imal": 1325,
      "Ġinteg": 1326,
      "ib": 1327,
      "boxed": 1328,
      "-b": 1329,
      "Ġdec": 1330,
      "assistant": 1331,
      "Ġfactor": 1332,
      ";Ċ": 1333,
      "ps": 1334,
      "ual": 1335,
      "Ġstr": 1336,
      "urs": 1337,
      "100": 1338,
      "]ĊĊ": 1339,
      "Ġmulti": 1340,
      "(n": 1341,
      "cept": 1342,
      "Ġask": 1343,
      "Ġstru": 1344,
      "ĠâĨĴ": 1345,
      "haps": 1346,
      "Ġident": 1347,
      "Ġcall": 1348,
      "Ġvert": 1349,
      "Ġint": 1350,
      "###": 1351,
      "Ġtyp": 1352,
      "Ġlim": 1353,
      "Ġyields": 1354,
      "Ġprint": 1355,
      "Ġpair": 1356,
      "Ġlarge": 1357,
      "uc": 1358,
      "202": 1359,
      "('": 1360,
      "oc": 1361,
      "Ġanal": 1362,
      "ffect": 1363,
      "yn": 1364,
      "\\[Ċ": 1365,
      "ool": 1366,
      "Ġcar": 1367,
      "lect": 1368,
      "Ġind": 1369,
      "}}": 1370,
      "Ġ->": 1371,
      "Ġreal": 1372,
      "ĠÎ²": 1373,
      "âĢĳ": 1374,
      "86": 1375,
      "pi": 1376,
      "ification": 1377,
      "Ġfol": 1378,
      "ane": 1379,
      "Ġconf": 1380,
      "lock": 1381,
      "Ġodd": 1382,
      "Ġlines": 1383,
      "Ġfl": 1384,
      ")/(": 1385,
      "Ġzero": 1386,
      "Ġder": 1387,
      "tep": 1388,
      "ĠWait": 1389,
      "Ġinf": 1390,
      "Ġoff": 1391,
      "75": 1392,
      "ople": 1393,
      "23": 1394,
      "ater": 1395,
      "Ġet": 1396,
      "ĠÎ³": 1397,
      "ings": 1398,
      "ĠInde": 1399,
      "Ġquestion": 1400,
      "atic": 1401,
      "Ġperson": 1402,
      "uring": 1403,
      "Ġent": 1404,
      "Ġhigh": 1405,
      "\")Ċ": 1406,
      "ross": 1407,
      "Ġcount": 1408,
      "Ġlet": 1409,
      "Ġcenter": 1410,
      "()": 1411,
      "pos": 1412,
      "ret": 1413,
      "olution": 1414,
      "Ġknow": 1415,
      "27": 1416,
      "\\)": 1417,
      "(a": 1418,
      "ness": 1419,
      "Ġpath": 1420,
      "ark": 1421,
      "':": 1422,
      "^n": 1423,
      "Ġmethod": 1424,
      "ural": 1425,
      "ons": 1426,
      "ability": 1427,
      "ĠOr": 1428,
      "Ġincre": 1429,
      "Ġwor": 1430,
      "ĠHe": 1431,
      "Ġer": 1432,
      "40": 1433,
      "Ġconc": 1434,
      "ĠNo": 1435,
      "Ġshow": 1436,
      "ternatively": 1437,
      "ied": 1438,
      "Ġear": 1439,
      "Ġfollow": 1440,
      "ĠâĪĪ": 1441,
      "):": 1442,
      "Ġratio": 1443,
      "velop": 1444,
      "ĠThere": 1445,
      "Ġexample": 1446,
      "ral": 1447,
      "Ġprocess": 1448,
      "Ġcontin": 1449,
      "ĠâĪļ": 1450,
      "Ġelse": 1451,
      "vel": 1452,
      "very": 1453,
      "ually": 1454,
      "Ġdesc": 1455,
      "Ġremain": 1456,
      "Ġless": 1457,
      "ull": 1458,
      "Ġaut": 1459,
      "Ġener": 1460,
      "Ġeffect": 1461,
      "Ġlist": 1462,
      "This": 1463,
      "Ġdown": 1464,
      "Alternatively": 1465,
      "35": 1466,
      "Ġtext": 1467,
      "Ġdenominator": 1468,
      "ctor": 1469,
      "Ġthose": 1470,
      "cles": 1471,
      "-s": 1472,
      "48": 1473,
      "(self": 1474,
      "ax": 1475,
      "ible": 1476,
      "Ġhelp": 1477,
      "ten": 1478,
      "ves": 1479,
      "Ġperhaps": 1480,
      "Ġproduct": 1481,
      "co": 1482,
      "times": 1483,
      "line": 1484,
      "Ġsa": 1485,
      "angu": 1486,
      "Ġenergy": 1487,
      "/p": 1488,
      "Ġmake": 1489,
      "Ġexactly": 1490,
      "Ġpeople": 1491,
      "ask": 1492,
      "Ġsecond": 1493,
      "72": 1494,
      "ĠÏĨ": 1495,
      "ĠWh": 1496,
      "hip": 1497,
      "Ġmon": 1498,
      "meric": 1499,
      "<|/": 1500,
      "90": 1501,
      "ie": 1502,
      "})": 1503,
      "Ġequal": 1504,
      "Ġlook": 1505,
      ":**Ċ": 1506,
      "ale": 1507,
      "Ġfound": 1508,
      "ument": 1509,
      "---": 1510,
      "Ġconstant": 1511,
      "Ġintersection": 1512,
      "old": 1513,
      "Ġwell": 1514,
      "(b": 1515,
      "iqu": 1516,
      "met": 1517,
      "omet": 1518,
      "Ġlog": 1519,
      "ĠâĢľ": 1520,
      "Ġoriginal": 1521,
      "}=": 1522,
      "Ġpossible": 1523,
      "Ġexponent": 1524,
      "```ĊĊ": 1525,
      "Ġprovide": 1526,
      "Ġour": 1527,
      "Ġinformation": 1528,
      "Ġmaxim": 1529,
      "hem": 1530,
      "Ġsl": 1531,
      "rror": 1532,
      "ving": 1533,
      "Ġser": 1534,
      "Ġgra": 1535,
      "Ġwhile": 1536,
      "acter": 1537,
      "mathb": 1538,
      "rix": 1539,
      "Ġleast": 1540,
      "ordin": 1541,
      "Ġvolume": 1542,
      "ration": 1543,
      "abel": 1544,
      "(\"": 1545,
      "93": 1546,
      "Ġcare": 1547,
      "ets": 1548,
      "Ġsides": 1549,
      "199": 1550,
      "uch": 1551,
      "âī": 1552,
      "ids": 1553,
      "Ġagain": 1554,
      "64": 1555,
      "of": 1556,
      "Ġname": 1557,
      "Ġperi": 1558,
      "Ġrequi": 1559,
      "pr": 1560,
      "ug": 1561,
      "ĠAmeric": 1562,
      "Ġdistance": 1563,
      "Ġ\"\"\"Ċ": 1564,
      "Ġref": 1565,
      "Ġarg": 1566,
      "50": 1567,
      "agn": 1568,
      "theta": 1569,
      "-c": 1570,
      "Ġap": 1571,
      "son": 1572,
      "ĠÏĢ": 1573,
      "Ġradi": 1574,
      "Ġarea": 1575,
      "ĠEn": 1576,
      "ompute": 1577,
      "42": 1578,
      "rem": 1579,
      "amet": 1580,
      "\\]ĊĊ": 1581,
      "ting": 1582,
      "Ġbase": 1583,
      "Ġprogram": 1584,
      "Ġapproach": 1585,
      "Ġcorrect": 1586,
      "ĠZ": 1587,
      "Ġact": 1588,
      "Ġinput": 1589,
      "ĠNot": 1590,
      "Ġsolutions": 1591,
      ",b": 1592,
      "ody": 1593,
      "Ġdepend": 1594,
      "Ġdevelop": 1595,
      "pendicular": 1596,
      "Ġholds": 1597,
      "================": 1598,
      "ube": 1599,
      "round": 1600,
      "less": 1601,
      "Ġcy": 1602,
      "Ġcalcul": 1603,
      ".<|": 1604,
      "ilar": 1605,
      "Ġroot": 1606,
      "str": 1607,
      "Ġcontain": 1608,
      "ĠIndeed": 1609,
      "32": 1610,
      "Ġopp": 1611,
      "Ġthree": 1612,
      "Ġ{Ċ": 1613,
      "ĠÎ¸": 1614,
      "Ġsatisfy": 1615,
      "**Ċ": 1616,
      "Ġnumer": 1617,
      "day": 1618,
      "Ġstring": 1619,
      "Ġperpendicular": 1620,
      "py": 1621,
      "Ġbeing": 1622,
      "ples": 1623,
      ")}": 1624,
      "_p": 1625,
      "ĠUs": 1626,
      "ton": 1627,
      "tex": 1628,
      "Ġsupp": 1629,
      "ension": 1630,
      "Ġderiv": 1631,
      "201": 1632,
      "omm": 1633,
      "plement": 1634,
      "Ġsing": 1635,
      "Ġve": 1636,
      "chn": 1637,
      "\",": 1638,
      "ults": 1639,
      "Ġatt": 1640,
      "Ġconstraints": 1641,
      ")).": 1642,
      "ash": 1643,
      "nect": 1644,
      "Ġdig": 1645,
      "Ġsays": 1646,
      "Ġbu": 1647,
      "Ġmem": 1648,
      "ier": 1649,
      "Ġfield": 1650,
      "chool": 1651,
      "Ġperiod": 1652,
      "iding": 1653,
      "()Ċ": 1654,
      "ward": 1655,
      "Ġ~": 1656,
      "Ġallow": 1657,
      "Ġmain": 1658,
      "Ġoutput": 1659,
      "Ġdivis": 1660,
      "Ġpattern": 1661,
      ">Ċ": 1662,
      "omes": 1663,
      "rid": 1664,
      "ven": 1665,
      "}Ċ": 1666,
      "Ġbefore": 1667,
      "iven": 1668,
      "65": 1669,
      "Ġinside": 1670,
      "for": 1671,
      "wh": 1672,
      "left": 1673,
      "Ġlangu": 1674,
      "ems": 1675,
      "Ġchildren": 1676,
      "ior": 1677,
      "ided": 1678,
      "Ġ>=": 1679,
      "Ġappe": 1680,
      "Ġstand": 1681,
      "Ġobject": 1682,
      "âĪŀ": 1683,
      "Ġlinear": 1684,
      "Ġpol": 1685,
      "ology": 1686,
      "\".": 1687,
      "Ġmeas": 1688,
      "Ġsimilar": 1689,
      "Ġstructure": 1690,
      "Ġdeg": 1691,
      "Ġregular": 1692,
      "44": 1693,
      "gor": 1694,
      "ily": 1695,
      "atures": 1696,
      "ormal": 1697,
      "----------------": 1698,
      "|Ċ": 1699,
      "Ġ)": 1700,
      "Ġrequire": 1701,
      "Ġnear": 1702,
      "Ġmid": 1703,
      "Error": 1704,
      "Ġ&": 1705,
      "If": 1706,
      "Ġcode": 1707,
      "Ġhy": 1708,
      "Ġtype": 1709,
      "Ġwithin": 1710,
      "âĶĢâĶĢâĶĢâĶĢ": 1711,
      "Ġsym": 1712,
      "Ġvisited": 1713,
      "ason": 1714,
      "other": 1715,
      "85": 1716,
      "Ġmatrix": 1717,
      ")(": 1718,
      "Ġav": 1719,
      "ĠAnd": 1720,
      "Ġlimit": 1721,
      "39": 1722,
      "ins": 1723,
      "gan": 1724,
      "iew": 1725,
      "cent": 1726,
      "ga": 1727,
      "wn": 1728,
      "Ġdeterm": 1729,
      "(Î": 1730,
      "Ġopt": 1731,
      "Ġrepresentation": 1732,
      "Ġcost": 1733,
      "Â°,": 1734,
      "Ġcurrent": 1735,
      "land": 1736,
      "over": 1737,
      "Ġcommon": 1738,
      "46": 1739,
      "alse": 1740,
      "37": 1741,
      "ches": 1742,
      "alth": 1743,
      "Ġhere": 1744,
      "vent": 1745,
      "ysis": 1746,
      "'Ċ": 1747,
      "_s": 1748,
      "cle": 1749,
      "Ġher": 1750,
      "ĠAr": 1751,
      "ilarly": 1752,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1753,
      "Ġwithout": 1754,
      "ade": 1755,
      "Ġcap": 1756,
      "Ġkey": 1757,
      "Ġbounded": 1758,
      "Con": 1759,
      "stand": 1760,
      "osite": 1761,
      "Ġrespon": 1762,
      "Ġearli": 1763,
      "Ġsolve": 1764,
      "Ġdistrib": 1765,
      "bit": 1766,
      "Ġshe": 1767,
      "ances": 1768,
      "Ġback": 1769,
      "ĠĠĠĠĠ": 1770,
      "Ġredu": 1771,
      "Ġyears": 1772,
      "+b": 1773,
      "ining": 1774,
      "Ġsequ": 1775,
      "'ll": 1776,
      "(u": 1777,
      "ĠLi": 1778,
      ".g": 1779,
      "Ġest": 1780,
      "Ġocc": 1781,
      "Ġâľ": 1782,
      "umn": 1783,
      "ists": 1784,
      "essage": 1785,
      "Ġrow": 1786,
      "For": 1787,
      "python": 1788,
      "Ġvertex": 1789,
      "pot": 1790,
      "Ġread": 1791,
      "Ġstatement": 1792,
      "Ġdou": 1793,
      "Ġdisc": 1794,
      "||": 1795,
      "Ġbl": 1796,
      "Ġtrue": 1797,
      "Ġvertices": 1798,
      "Ġmeans": 1799,
      "tem": 1800,
      "name": 1801,
      "ĠDM": 1802,
      "ĠâĪĳ": 1803,
      "Ġsurf": 1804,
      "Ġetc": 1805,
      "31": 1806,
      "}.": 1807,
      "ann": 1808,
      "Ġway": 1809,
      "Ġstart": 1810,
      "cial": 1811,
      "Ġcle": 1812,
      "utes": 1813,
      "ĠRet": 1814,
      "95": 1815,
      "ob": 1816,
      "---ĊĊ": 1817,
      "')": 1818,
      "}(": 1819,
      "imilarly": 1820,
      "ulation": 1821,
      "ately": 1822,
      "+z": 1823,
      "38": 1824,
      ",y": 1825,
      "gs": 1826,
      "Ġtimes": 1827,
      "Ġ==": 1828,
      "Ġcube": 1829,
      "Ġfour": 1830,
      "Ġnecess": 1831,
      "_{\\": 1832,
      "Ġlikely": 1833,
      "Ġearlier": 1834,
      "Ġmed": 1835,
      "etic": 1836,
      "Ġ\\)": 1837,
      "Ġexper": 1838,
      "hedron": 1839,
      "((": 1840,
      "?Ċ": 1841,
      "ared": 1842,
      "led": 1843,
      "ĠĠĊ": 1844,
      "arrow": 1845,
      "ON": 1846,
      "min": 1847,
      "Ġtop": 1848,
      "ĠÎĶ": 1849,
      "Ġvery": 1850,
      "sib": 1851,
      "Ġexpression": 1852,
      "/n": 1853,
      "76": 1854,
      "ified": 1855,
      "att": 1856,
      "Ġfam": 1857,
      "Ġmet": 1858,
      "Ġindex": 1859,
      "29": 1860,
      "='": 1861,
      "point": 1862,
      "Ġtem": 1863,
      "Ġverify": 1864,
      "ran": 1865,
      "ense": 1866,
      "Ġtechn": 1867,
      "ho": 1868,
      "ling": 1869,
      "roup": 1870,
      "rection": 1871,
      "ivity": 1872,
      "mon": 1873,
      "vis": 1874,
      "ample": 1875,
      "Ġrational": 1876,
      "ertain": 1877,
      "ential": 1878,
      "imension": 1879,
      "Ġgreat": 1880,
      "Ġmean": 1881,
      "arily": 1882,
      "ix": 1883,
      "rue": 1884,
      "ern": 1885,
      "ety": 1886,
      "ails": 1887,
      "view": 1888,
      "ĠPython": 1889,
      "Ġpartic": 1890,
      "tain": 1891,
      "Ġconnect": 1892,
      "ters": 1893,
      "Ġexpl": 1894,
      "21": 1895,
      "Ġpub": 1896,
      "Ġwrite": 1897,
      "ards": 1898,
      "**:Ċ": 1899,
      "Ġstudents": 1900,
      "Ġrese": 1901,
      "Ġvia": 1902,
      "Ġdon": 1903,
      "Ġnow": 1904,
      "etra": 1905,
      "ĠAs": 1906,
      "180": 1907,
      "An": 1908,
      "part": 1909,
      "Ġstill": 1910,
      "ĠThey": 1911,
      "ĠRHS": 1912,
      "ique": 1913,
      "Ġsepar": 1914,
      "Ġintersect": 1915,
      "gin": 1916,
      "ither": 1917,
      "Ġduring": 1918,
      "Ġbecomes": 1919,
      "Ġsay": 1920,
      "Ġpent": 1921,
      "iron": 1922,
      ".s": 1923,
      "alle": 1924,
      "Ġpres": 1925,
      "Ġpop": 1926,
      "Ġsize": 1927,
      "Ġdid": 1928,
      "Ġprec": 1929,
      "arth": 1930,
      "ircles": 1931,
      "Ġcho": 1932,
      "ape": 1933,
      "Ġ...": 1934,
      "Ġlower": 1935,
      "Ġanaly": 1936,
      "Step": 1937,
      "_f": 1938,
      "Ġtetra": 1939,
      "ctan": 1940,
      "ograph": 1941,
      "Ġmatch": 1942,
      "Ġindeed": 1943,
      "Ġcomplex": 1944,
      "iply": 1945,
      "Wh": 1946,
      "_d": 1947,
      "vex": 1948,
      "Ġexpect": 1949,
      "Ġcoordin": 1950,
      "Ġ]": 1951,
      "atural": 1952,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1953,
      ".c": 1954,
      "apt": 1955,
      "ivers": 1956,
      "Ġsw": 1957,
      "Ġke": 1958,
      "aces": 1959,
      "Ġgives": 1960,
      "Ġcommun": 1961,
      "99": 1962,
      "=\"": 1963,
      "Ġdesign": 1964,
      ",\\": 1965,
      "Ġadj": 1966,
      "Ġworks": 1967,
      "Ġtak": 1968,
      "Ġmass": 1969,
      "verse": 1970,
      "Ġcareful": 1971,
      "$ĊĊ": 1972,
      "']": 1973,
      "any": 1974,
      "Ġproperty": 1975,
      "Ġmaximum": 1976,
      "Ġopposite": 1977,
      "AB": 1978,
      "osed": 1979,
      "elta": 1980,
      "ĠLe": 1981,
      "Ġabove": 1982,
      "Ġdistin": 1983,
      "$Ċ": 1984,
      "Ġdra": 1985,
      "ĠUse": 1986,
      "Ġfunctions": 1987,
      "work": 1988,
      "Ġtan": 1989,
      "Ġblock": 1990,
      "Ġhum": 1991,
      "Ġcomb": 1992,
      "Ġcomput": 1993,
      "Ġcharacter": 1994,
      "Ġedge": 1995,
      "Ġpentagon": 1996,
      "$.": 1997,
      "omb": 1998,
      "Ġpoly": 1999,
      "Ġphys": 2000,
      "Pro": 2001,
      "ict": 2002,
      "pen": 2003,
      "alu": 2004,
      "def": 2005,
      "Ġarctan": 2006,
      "ock": 2007,
      "Ġtreat": 2008,
      "Ġevery": 2009,
      "adr": 2010,
      "sc": 2011,
      "reak": 2012,
      "Ġtheore": 2013,
      "ird": 2014,
      "Ġseg": 2015,
      "âĤ": 2016,
      "Ġart": 2017,
      "Ġoften": 2018,
      "Ġrun": 2019,
      "34": 2020,
      "ference": 2021,
      "Ġformul": 2022,
      "version": 2023,
      "Ġtetrahedron": 2024,
      "['": 2025,
      "where": 2026,
      "Ġserv": 2027,
      "Ġpresent": 2028,
      "Ġ(âĪ": 2029,
      "asing": 2030,
      "ote": 2031,
      "istic": 2032,
      "Ġmak": 2033,
      "-f": 2034,
      "Ġens": 2035,
      "Ġelect": 2036,
      "gra": 2037,
      "rans": 2038,
      "esc": 2039,
      "ĠSy": 2040,
      "ready": 2041,
      "med": 2042,
      "orts": 2043,
      "Ġmy": 2044,
      "Ġge": 2045,
      "ival": 2046,
      "viron": 2047,
      "Ġlong": 2048,
      "ĠAt": 2049,
      "001": 2050,
      "âĢĵ": 2051,
      "Ġinclude": 2052,
      "Ġnet": 2053,
      "ithm": 2054,
      "ĠNew": 2055,
      "ables": 2056,
      "Ġgood": 2057,
      "(c": 2058,
      "Given": 2059,
      "ove": 2060,
      "ĠPl": 2061,
      "Ġinvol": 2062,
      "Ġcontinu": 2063,
      "sum": 2064,
      "Ġlead": 2065,
      "Ġradius": 2066,
      "Ġdouble": 2067,
      "erial": 2068,
      "aybe": 2069,
      "(i": 2070,
      "ery": 2071,
      "Ġpot": 2072,
      "Ġsug": 2073,
      "ĠEarth": 2074,
      "Ġcomplete": 2075,
      "ĠRes": 2076,
      "ĠNone": 2077,
      "|><|": 2078,
      "Ġcreate": 2079,
      "orn": 2080,
      "ĠSe": 2081,
      "âĢĶ": 2082,
      "ccess": 2083,
      "ĠYes": 2084,
      "Ġconsist": 2085,
      "Ġincludes": 2086,
      "Ġsingle": 2087,
      "oid": 2088,
      "ware": 2089,
      "ĠâĪ«": 2090,
      "Ġquadr": 2091,
      "Ġvalid": 2092,
      "Ġcolor": 2093,
      "Ġfollowing": 2094,
      "ze": 2095,
      "Ġpy": 2096,
      "ially": 2097,
      "Ġmagn": 2098,
      "quad": 2099,
      "Ġsmallest": 2100,
      "(z": 2101,
      "big": 2102,
      "inal": 2103,
      "ination": 2104,
      "otal": 2105,
      "Ġschool": 2106,
      "Ġposition": 2107,
      "Ġstandard": 2108,
      "itude": 2109,
      "ives": 2110,
      "ource": 2111,
      "Ġdigit": 2112,
      "ife": 2113,
      "Ġimplement": 2114,
      "Ġphase": 2115,
      "Ġâľĵ": 2116,
      "à®": 2117,
      "itial": 2118,
      "Ġgu": 2119,
      "Ġresults": 2120,
      "</": 2121,
      "ways": 2122,
      "Ġcircles": 2123,
      "70": 2124,
      "Â²": 2125,
      "Ġ%": 2126,
      "Ġgraph": 2127,
      "chan": 2128,
      "Ġcolumn": 2129,
      "Ġdefine": 2130,
      "}^{": 2131,
      "Ġsubt": 2132,
      "_m": 2133,
      "Ġfi": 2134,
      "Ġbased": 2135,
      "ription": 2136,
      "ĠPh": 2137,
      "clus": 2138,
      "Ġaddition": 2139,
      "Us": 2140,
      "Ġformat": 2141,
      "Ġdefined": 2142,
      "ĠâĪĳ_{": 2143,
      "Ġhom": 2144,
      "Ġapproxim": 2145,
      "Ġelement": 2146,
      "Ġdirectly": 2147,
      "-d": 2148,
      "side": 2149,
      "verage": 2150,
      "uration": 2151,
      "Ġmax": 2152,
      "fficient": 2153,
      "Ġsaid": 2154,
      ")\\": 2155,
      "{(": 2156,
      "eta": 2157,
      "Ġrect": 2158,
      "iles": 2159,
      "\":": 2160,
      ")*(": 2161,
      "Ġrest": 2162,
      "ators": 2163,
      "Ġgoing": 2164,
      "mathbf": 2165,
      "me": 2166,
      "Ġday": 2167,
      "-st": 2168,
      "Ġtake": 2169,
      "Ġmade": 2170,
      "Ġlink": 2171,
      "Ġcharge": 2172,
      "Ġbody": 2173,
      "ĠOption": 2174,
      "Ġimp": 2175,
      "Ġplace": 2176,
      "Ġacross": 2177,
      "Ġdistinct": 2178,
      "pret": 2179,
      "ales": 2180,
      "class": 2181,
      "}^": 2182,
      "aring": 2183,
      "ental": 2184,
      "ĠIs": 2185,
      "Ġprote": 2186,
      "Ġboundary": 2187,
      ",i": 2188,
      "So": 2189,
      "lam": 2190,
      "til": 2191,
      "Ġprof": 2192,
      "Key": 2193,
      "_id": 2194,
      "}.ĊĊ": 2195,
      "Ġmention": 2196,
      "Ġmuch": 2197,
      "Ġeither": 2198,
      "Ġthough": 2199,
      "ĠAf": 2200,
      "Ġimage": 2201,
      "Ġplay": 2202,
      "Ġunderstand": 2203,
      "Ġlanguage": 2204,
      "Ġsurface": 2205,
      "group": 2206,
      "way": 2207,
      "uth": 2208,
      "Ġell": 2209,
      "Ġlow": 2210,
      "ift": 2211,
      "rm": 2212,
      "Ġ:": 2213,
      "Ġnormal": 2214,
      "Ġprove": 2215,
      "add": 2216,
      "Ġâīł": 2217,
      "Ġrot": 2218,
      "aving": 2219,
      "Ġimportant": 2220,
      "Ġcalled": 2221,
      "Ġerror": 2222,
      "80": 2223,
      "col": 2224,
