{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|pad|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|bos|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<|eos|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<|unk|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<|im_start|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<|im_end|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "<|system|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 7,
      "content": "<|user|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 8,
      "content": "<|assistant|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 9,
      "content": "<|think|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 10,
      "content": "<|/think|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 11,
      "content": "<|answer|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 12,
      "content": "<|/answer|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 13,
      "content": "<|tool_call|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 14,
      "content": "<|/tool_call|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 15,
      "content": "<|tool_result|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 16,
      "content": "<|/tool_result|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 17,
      "content": "<|image|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 18,
      "content": "<|/image|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 19,
      "content": "<|patch|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 20,
      "content": "<|fim_prefix|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 21,
      "content": "<|fim_middle|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 22,
      "content": "<|fim_suffix|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 23,
      "content": "<|alpha|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 24,
      "content": "<|beta|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 25,
      "content": "<|reserved_0|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 26,
      "content": "<|reserved_1|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 27,
      "content": "<|reserved_2|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 28,
      "content": "<|reserved_3|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 29,
      "content": "<|reserved_4|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 30,
      "content": "<|reserved_5|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 31,
      "content": "<|reserved_6|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "NFC"
  },
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Split",
        "pattern": {
          "Regex": "(?i:'s|'t|'re|'ve|'m|'ll|'d)|[^\\r\\n\\p{L}\\p{N}]?+\\p{L}+|\\p{N}{1,3}| ?[^\\s\\p{L}\\p{N}]++[\\r\\n]*|\\s*[\\r\\n]|\\s+(?!\\S)|\\s+"
        },
        "behavior": "Isolated",
        "invert": false
      },
      {
        "type": "ByteLevel",
        "add_prefix_space": false,
        "trim_offsets": true,
        "use_regex": false
      }
    ]
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<|unk|>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|pad|>": 0,
      "<|bos|>": 1,
      "<|eos|>": 2,
      "<|unk|>": 3,
      "<|im_start|>": 4,
      "<|im_end|>": 5,
      "<|system|>": 6,
      "<|user|>": 7,
      "<|assistant|>": 8,
      "<|think|>": 9,
      "<|/think|>": 10,
      "<|answer|>": 11,
      "<|/answer|>": 12,
      "<|tool_call|>": 13,
      "<|/tool_call|>": 14,
      "<|tool_result|>": 15,
      "<|/tool_result|>": 16,
      "<|image|>": 17,
      "<|/image|>": 18,
      "<|patch|>": 19,
      "<|fim_prefix|>": 20,
      "<|fim_middle|>": 21,
      "<|fim_suffix|>": 22,
      "<|alpha|>": 23,
      "<|beta|>": 24,
      "<|reserved_0|>": 25,
      "<|reserved_1|>": 26,
      "<|reserved_2|>": 27,
      "<|reserved_3|>": 28,
      "<|reserved_4|>": 29,
      "<|reserved_5|>": 30,
      "<|reserved_6|>": 31,
      "!": 32,
      "\"": 33,
      "#": 34,
      "$": 35,
      "%": 36,
      "&": 37,
      "'": 38,
      "(": 39,
      ")": 40,
      "*": 41,
      "+": 42,
      ",": 43,
      "-": 44,
      ".": 45,
      "/": 46,
      "0": 47,
      "1": 48,
      "2": 49,
      "3": 50,
      "4": 51,
      "5": 52,
      "6": 53,
      "7": 54,
      "8": 55,
      "9": 56,
      ":": 57,
      ";": 58,
      "<": 59,
      "=": 60,
      ">": 61,
      "?": 62,
      "@": 63,
      "A": 64,
      "B": 65,
      "C": 66,
      "D": 67,
      "E": 68,
      "F": 69,
      "G": 70,
      "H": 71,
      "I": 72,
      "J": 73,
      "K": 74,
      "L": 75,
      "M": 76,
      "N": 77,
      "O": 78,
      "P": 79,
      "Q": 80,
      "R": 81,
      "S": 82,
      "T": 83,
      "U": 84,
      "V": 85,
      "W": 86,
      "X": 87,
      "Y": 88,
      "Z": 89,
      "[": 90,
      "\\": 91,
      "]": 92,
      "^": 93,
      "_": 94,
      "`": 95,
      "a": 96,
      "b": 97,
      "c": 98,
      "d": 99,
      "e": 100,
      "f": 101,
      "g": 102,
      "h": 103,
      "i": 104,
      "j": 105,
      "k": 106,
      "l": 107,
      "m": 108,
      "n": 109,
      "o": 110,
      "p": 111,
      "q": 112,
      "r": 113,
      "s": 114,
      "t": 115,
      "u": 116,
      "v": 117,
      "w": 118,
      "x": 119,
      "y": 120,
      "z": 121,
      "{": 122,
      "|": 123,
      "}": 124,
      "~": 125,
      "¡": 126,
      "¢": 127,
      "£": 128,
      "¤": 129,
      "¥": 130,
      "¦": 131,
      "§": 132,
      "¨": 133,
      "©": 134,
      "ª": 135,
      "«": 136,
      "¬": 137,
      "®": 138,
      "¯": 139,
      "°": 140,
      "±": 141,
      "²": 142,
      "³": 143,
      "´": 144,
      "µ": 145,
      "¶": 146,
      "·": 147,
      "¸": 148,
      "¹": 149,
      "º": 150,
      "»": 151,
      "¼": 152,
      "½": 153,
      "¾": 154,
      "¿": 155,
      "À": 156,
      "Á": 157,
      "Â": 158,
      "Ã": 159,
      "Ä": 160,
      "Å": 161,
      "Æ": 162,
      "Ç": 163,
      "È": 164,
      "É": 165,
      "Ê": 166,
      "Ë": 167,
      "Ì": 168,
      "Í": 169,
      "Î": 170,
      "Ï": 171,
      "Ð": 172,
      "Ñ": 173,
      "Ò": 174,
      "Ó": 175,
      "Ô": 176,
      "Õ": 177,
      "Ö": 178,
      "×": 179,
      "Ø": 180,
      "Ù": 181,
      "Ú": 182,
      "Û": 183,
      "Ü": 184,
      "Ý": 185,
      "Þ": 186,
      "ß": 187,
      "à": 188,
      "á": 189,
      "â": 190,
      "ã": 191,
      "ä": 192,
      "å": 193,
      "æ": 194,
      "ç": 195,
      "è": 196,
      "é": 197,
      "ê": 198,
      "ë": 199,
      "ì": 200,
      "í": 201,
      "î": 202,
      "ï": 203,
      "ð": 204,
      "ñ": 205,
      "ò": 206,
      "ó": 207,
      "ô": 208,
      "õ": 209,
      "ö": 210,
      "÷": 211,
      "ø": 212,
      "ù": 213,
      "ú": 214,
      "û": 215,
      "ü": 216,
      "ý": 217,
      "þ": 218,
      "ÿ": 219,
      "Ā": 220,
      "ā": 221,
      "Ă": 222,
      "ă": 223,
      "Ą": 224,
      "ą": 225,
      "Ć": 226,
      "ć": 227,
      "Ĉ": 228,
      "ĉ": 229,
      "Ċ": 230,
      "ċ": 231,
      "Č": 232,
      "č": 233,
      "Ď": 234,
      "ď": 235,
      "Đ": 236,
      "đ": 237,
      "Ē": 238,
      "ē": 239,
      "Ĕ": 240,
      "ĕ": 241,
      "Ė": 242,
      "ė": 243,
      "Ę": 244,
      "ę": 245,
      "Ě": 246,
      "ě": 247,
      "Ĝ": 248,
      "ĝ": 249,
      "Ğ": 250,
      "ğ": 251,
      "Ġ": 252,
      "ġ": 253,
      "Ģ": 254,
      "ģ": 255,
      "Ĥ": 256,
      "ĥ": 257,
      "Ħ": 258,
      "ħ": 259,
      "Ĩ": 260,
      "ĩ": 261,
      "Ī": 262,
      "ī": 263,
      "Ĭ": 264,
      "ĭ": 265,
      "Į": 266,
      "į": 267,
      "İ": 268,
      "ı": 269,
      "Ĳ": 270,
      "ĳ": 271,
      "Ĵ": 272,
      "ĵ": 273,
      "Ķ": 274,
      "ķ": 275,
      "ĸ": 276,
      "Ĺ": 277,
      "ĺ": 278,
      "Ļ": 279,
      "ļ": 280,
      "Ľ": 281,
      "ľ": 282,
      "Ŀ": 283,
      "ŀ": 284,
      "Ł": 285,
      "ł": 286,
      "Ń": 287,
      "Ġt": 288,
      "ĠĠ": 289,
      "Ġa": 290,
      "in": 291,
      "he": 292,
      "on": 293,
      "er": 294,
      "Ġs": 295,
      "re": 296,
      "Ġthe": 297,
      "at": 298,
      "Ġc": 299,
      "or": 300,
      "en": 301,
      "is": 302,
      "es": 303,
      "al": 304,
      "Ġp": 305,
      "Ġw": 306,
      "it": 307,
      "Ġ=": 308,
      "Ġf": 309,
      "an": 310,
      "Ġo": 311,
      "Ġb": 312,
      "ĠĠĠĠ": 313,
      "Ġ(": 314,
      "ion": 315,
      "ed": 316,
      "Ġm": 317,
      "Ġan": 318,
      "ar": 319,
      "le": 320,
      "Ġd": 321,
      "Ġin": 322,
      "ing": 323,
      "Ġof": 324,
      "ct": 325,
      "ro": 326,
      ".Ċ": 327,
      "Ġn": 328,
      "Ġto": 329,
      "ic": 330,
      "Ġ-": 331,
      "Ġe": 332,
      "Ġis": 333,
      "ut": 334,
      "us": 335,
      "Ġand": 336,
      "ĠS": 337,
      "ent": 338,
      "et": 339,
      "Ġth": 340,
      "as": 341,
      "Ġ+": 342,
      "ly": 343,
      "om": 344,
      "ve": 345,
      "Ġl": 346,
      "Ġre": 347,
      "im": 348,
      ".ĊĊ": 349,
      "Ġh": 350,
      "ĠA": 351,
      "ĠT": 352,
      "ou": 353,
      "ot": 354,
      "ac": 355,
      "id": 356,
      "ation": 357,
      "st": 358,
      "Ġfor": 359,
      "um": 360,
      "ig": 361,
      "il": 362,
      "ĠĠĠ": 363,
      "ol": 364,
      "Ġg": 365,
      "ce": 366,
      "Ġbe": 367,
      "ow": 368,
      "Ġwe": 369,
      "if": 370,
      "Ġcon": 371,
      "os": 372,
      "Ġthat": 373,
      "ĠC": 374,
      "Ġ\\": 375,
      "ver": 376,
      "qu": 377,
      "ĠB": 378,
      "ra": 379,
      "ĠSo": 380,
      "ul": 381,
      "**": 382,
      "Ġon": 383,
      ").": 384,
      "ter": 385,
      "ĠI": 386,
      "Ġst": 387,
      "ith": 388,
      "ur": 389,
      "ĠĠĠĠĠĠĠĠ": 390,
      "un": 391,
      "ĊĊ": 392,
      "el": 393,
      "ĠThe": 394,
      "Ġâ": 395,
      "ir": 396,
      "am": 397,
      "Ġy": 398,
      "Ġwith": 399,
      "od": 400,
      "Ġpro": 401,
      "Ġex": 402,
      "Ġ$": 403,
      "Ġal": 404,
      "ay": 405,
      "Ġor": 406,
      "ist": 407,
      "ri": 408,
      "ch": 409,
      "Ġare": 410,
      "Ġas": 411,
      "Ġv": 412,
      "Ġne": 413,
      "Ġx": 414,
      "ĠL": 415,
      "Ġcan": 416,
      "'s": 417,
      "ect": 418,
      "ĠP": 419,
      "ate": 420,
      "ive": 421,
      "Ġat": 422,
      "ad": 423,
      "te": 424,
      "int": 425,
      "Ġr": 426,
      "res": 427,
      "ge": 428,
      "iv": 429,
      "Ġcom": 430,
      "ble": 431,
      "ĠD": 432,
      "th": 433,
      "pp": 434,
      "ĠM": 435,
      "Ġ\"": 436,
      "ĠF": 437,
      "rom": 438,
      ":Ċ": 439,
      "ally": 440,
      "Ġit": 441,
      "igh": 442,
      "Ġde": 443,
      "ity": 444,
      "ine": 445,
      "--": 446,
      "se": 447,
      "ment": 448,
      "ers": 449,
      "her": 450,
      "Ġnot": 451,
      "Ġby": 452,
      "est": 453,
      "Ġsu": 454,
      "Ġk": 455,
      "ĠN": 456,
      "Ġwh": 457,
      "ave": 458,
      "00": 459,
      "ant": 460,
      ")Ċ": 461,
      "end": 462,
      "ess": 463,
      "ĠĠĠĠĠĠĠ": 464,
      "Ġus": 465,
      "ĠR": 466,
      "ction": 467,
      "Ġfrom": 468,
      "art": 469,
      "lo": 470,
      "ld": 471,
      "ĠH": 472,
      "Th": 473,
      "pt": 474,
      "oun": 475,
      "ĠE": 476,
      "ight": 477,
      "Ġhave": 478,
      "pe": 479,
      "Ġse": 480,
      "Ġpo": 481,
      "ĠO": 482,
      "ang": 483,
      "and": 484,
      "ies": 485,
      "ĠW": 486,
      "iz": 487,
      "de": 488,
      "),": 489,
      "ple": 490,
      "^{": 491,
      "pl": 492,
      "ain": 493,
      "ore": 494,
      "em": 495,
      "Ġle": 496,
      "ach": 497,
      "Thus": 498,
      "ĠÎ": 499,
      "Ġneed": 500,
      "_{": 501,
      "Ġif": 502,
      "Ġch": 503,
      "Ġ**": 504,
      "ould": 505,
      "Ġ*": 506,
      "ctu": 507,
      "Ġsh": 508,
      "âĢ": 509,
      "put": 510,
      "ke": 511,
      "ition": 512,
      "Ġâī": 513,
      "act": 514,
      "10": 515,
      "all": 516,
      "ust": 517,
      "Ġnum": 518,
      "ide": 519,
      "Ġun": 520,
      "rt": 521,
      "ial": 522,
      "ab": 523,
      "ck": 524,
      "ult": 525,
      "Ġall": 526,
      "ĠTh": 527,
      "Ġhe": 528,
      "Ġu": 529,
      "ort": 530,
      "ass": 531,
      "ĠG": 532,
      "ill": 533,
      "cl": 534,
      "ĠIn": 535,
      "ĠLet": 536,
      "ich": 537,
      "Ġ/": 538,
      "Ġwhe": 539,
      "ds": 540,
      "Ġma": 541,
      "du": 542,
      "Ġinter": 543,
      "ical": 544,
      "Ġpoint": 545,
      "per": 546,
      "Ġper": 547,
      "der": 548,
      "Ġtr": 549,
      "bo": 550,
      "Ġbut": 551,
      "qrt": 552,
      "ans": 553,
      "Ġnumb": 554,
      "==": 555,
      "so": 556,
      "ase": 557,
      "Ġsum": 558,
      "are": 559,
      "og": 560,
      "ps": 561,
      "ure": 562,
      "ue": 563,
      "our": 564,
      "Ġthis": 565,
      "ince": 566,
      "ag": 567,
      "Ġ>": 568,
      "ff": 569,
      "ite": 570,
      "12": 571,
      "Ġfin": 572,
      "Ġme": 573,
      "Ġpos": 574,
      "rac": 575,
      "ĠBut": 576,
      "ome": 577,
      "ĠâĪ": 578,
      "Ġver": 579,
      "Ġeach": 580,
      "Ġim": 581,
      "ctually": 582,
      "gh": 583,
      "erm": 584,
      "Ġwhich": 585,
      "ence": 586,
      ")/": 587,
      "ire": 588,
      "xt": 589,
      "Ġ`": 590,
      "Ġso": 591,
      "ame": 592,
      "ative": 593,
      "Ġequ": 594,
      "ations": 595,
      "Ġco": 596,
      "The": 597,
      "ud": 598,
      "ĠU": 599,
      "orm": 600,
      "Ġres": 601,
      "Ġpl": 602,
      "Ġro": 603,
      "Ġcont": 604,
      "_i": 605,
      ")^": 606,
      "|>": 607,
      "ph": 608,
      "Ġmay": 609,
      "<|": 610,
      "ution": 611,
      "Ġ=>": 612,
      "ath": 613,
      "Ġen": 614,
      "ther": 615,
      "..": 616,
      "Ġthey": 617,
      "Ġany": 618,
      "rou": 619,
      "Ġ'": 620,
      "(x": 621,
      "}{": 622,
      "ĠĠĠĠĠĠĠĠĠĠĠ": 623,
      "frac": 624,
      "Ġapp": 625,
      "wer": 626,
      "Ġ{": 627,
      "ime": 628,
      "Ġad": 629,
      "to": 630,
      "age": 631,
      "fer": 632,
      "Ġmod": 633,
      "ance": 634,
      "Ġtri": 635,
      "ru": 636,
      "Ġline": 637,
      "20": 638,
      "ated": 639,
      "ard": 640,
      "be": 641,
      "ary": 642,
      "----": 643,
      "ĠFor": 644,
      ":ĊĊ": 645,
      "ast": 646,
      "Ġqu": 647,
      "ree": 648,
      "Ġone": 649,
      "Ġtw": 650,
      "Ġar": 651,
      "angle": 652,
      "Ġhas": 653,
      "ĠActually": 654,
      "ace": 655,
      "Ġexp": 656,
      "Ġcl": 657,
      "19": 658,
      "Ġsol": 659,
      "Ġ|": 660,
      "Ġsqrt": 661,
      "sion": 662,
      "Ġ$\\": 663,
      "Ġwor": 664,
      "con": 665,
      "ous": 666,
      "Ġdist": 667,
      "cess": 668,
      "si": 669,
      "ign": 670,
      "aus": 671,
      "Ġthere": 672,
      "Ġ<": 673,
      "ack": 674,
      "able": 675,
      "Ġalso": 676,
      "ose": 677,
      "elf": 678,
      "``": 679,
      "Ġwas": 680,
      "ger": 681,
      "Ġtwo": 682,
      "Ġmo": 683,
      "ound": 684,
      "Ġdo": 685,
      "ates": 686,
      "Ġ[": 687,
      "Ġpr": 688,
      "Ġsy": 689,
      "swer": 690,
      "Ġval": 691,
      "ors": 692,
      "Ġnumber": 693,
      "Ġsp": 694,
      "we": 695,
      "Ġabo": 696,
      "pute": 697,
      "dition": 698,
      "tern": 699,
      "Ġi": 700,
      "Ġconst": 701,
      "ific": 702,
      "ari": 703,
      "urn": 704,
      "irc": 705,
      "Ġac": 706,
      "Ġli": 707,
      "ount": 708,
      "Ġother": 709,
      "Ġanswer": 710,
      "ll": 711,
      "ĠĊ": 712,
      "Ġwhere": 713,
      "Ġbet": 714,
      "Ġz": 715,
      "pec": 716,
      "Ġang": 717,
      "ep": 718,
      "ren": 719,
      "ip": 720,
      "Ġyou": 721,
      "Ġ\\(": 722,
      "Ġj": 723,
      "Ġcol": 724,
      "ong": 725,
      "own": 726,
      "ft": 727,
      "Ġbec": 728,
      "16": 729,
      "Ġcons": 730,
      "Ġthen": 731,
      "Ġsuch": 732,
      "âĪ": 733,
      ".,": 734,
      "ient": 735,
      "Ġinte": 736,
      "Ġform": 737,
      "Ġlo": 738,
      "ces": 739,
      "Ġev": 740,
      "Ġsin": 741,
      "ĠThis": 742,
      "Ġfun": 743,
      "ĠJ": 744,
      "ear": 745,
      "Ġmust": 746,
      "ory": 747,
      "les": 748,
      "Ġout": 749,
      "ink": 750,
      "ord": 751,
      "heck": 752,
      "Ġsc": 753,
      "eth": 754,
      "Ġset": 755,
      "Â°": 756,
      "25": 757,
      "Ġpart": 758,
      "ile": 759,
      "ĠThen": 760,
      "ry": 761,
      "ater": 762,
      "Ġsome": 763,
      "form": 764,
      "Ġpre": 765,
      "Now": 766,
      "ween": 767,
      "Ġdis": 768,
      "ap": 769,
      "Ġterm": 770,
      "li": 771,
      "Ġdif": 772,
      "18": 773,
      "av": 774,
      "Ġmore": 775,
      "_n": 776,
      "ĠV": 777,
      "ize": 778,
      "))": 779,
      "Ġbetween": 780,
      "iel": 781,
      "ew": 782,
      "Ġdef": 783,
      "Ġfind": 784,
      "Ġcomp": 785,
      "oth": 786,
      "ause": 787,
      "ular": 788,
      "low": 789,
      "}$": 790,
      "##": 791,
      "ak": 792,
      "ice": 793,
      "port": 794,
      "rough": 795,
      "cre": 796,
      "âĢĻ": 797,
      "Ġsub": 798,
      "11": 799,
      "ub": 800,
      "Ġprodu": 801,
      "Ġmin": 802,
      "text": 803,
      "ĠK": 804,
      "Ġcos": 805,
      "Ġabout": 806,
      "ĠAB": 807,
      "Ġman": 808,
      "Ġonly": 809,
      "ĠÏ": 810,
      "Ġret": 811,
      "Ġ#": 812,
      "ection": 813,
      "one": 814,
      "15": 815,
      "Ġno": 816,
      "ĠY": 817,
      "13": 818,
      "Ġfunction": 819,
      "We": 820,
      "ring": 821,
      "ks": 822,
      "Ġpoints": 823,
      "Ġthan": 824,
      "Ġkn": 825,
      "Ġangle": 826,
      "Ġlike": 827,
      "the": 828,
      "ail": 829,
      "**:": 830,
      "Ġtriangle": 831,
      "blem": 832,
      "eng": 833,
      "ĠSince": 834,
      "ents": 835,
      "Ġspec": 836,
      "ress": 837,
      "ator": 838,
      "Ġwill": 839,
      "ider": 840,
      "====": 841,
      "Ġits": 842,
      "ices": 843,
      "ener": 844,
      "Ġthrough": 845,
      "ĠIf": 846,
      "/(": 847,
      "Ġtheir": 848,
      "irst": 849,
      "Ġsm": 850,
      "pend": 851,
      "di": 852,
      ";Ċ": 853,
      "Ġdiffer": 854,
      "ĠâīĪ": 855,
      "ays": 856,
      "cur": 857,
      "Ġproblem": 858,
      "Ġmaybe": 859,
      "Ġreg": 860,
      "Ġcor": 861,
      "cy": 862,
      "Ġra": 863,
      "ĠX": 864,
      "ens": 865,
      "Ġsolution": 866,
      "ĠSt": 867,
      "_st": 868,
      "iven": 869,
      "Ġup": 870,
      "Ġuse": 871,
      "Ġcondition": 872,
      "Ġusing": 873,
      "Ġdiv": 874,
      "14": 875,
      "ere": 876,
      "Ġcirc": 877,
      "Ġreturn": 878,
      "Ġshould": 879,
      "ric": 880,
      "ys": 881,
      "ell": 882,
      "|>Ċ": 883,
      "Ġcompute": 884,
      "Ġincl": 885,
      "Ġwould": 886,
      "imes": 887,
      "ia": 888,
      "Ġpar": 889,
      "air": 890,
      "ments": 891,
      "als": 892,
      "Ġside": 893,
      "Ġover": 894,
      "itive": 895,
      "ength": 896,
      "Ġdi": 897,
      "Ġsim": 898,
      "ues": 899,
      "Ġsqu": 900,
      "ever": 901,
      "sible": 902,
      "ma": 903,
      "Ġed": 904,
      "Ġgo": 905,
      "But": 906,
      "Ġboth": 907,
      "ise": 908,
      "Ġte": 909,
      "ram": 910,
      "Ġmat": 911,
      "ĠThat": 912,
      "ok": 913,
      "ata": 914,
      ".e": 915,
      "ject": 916,
      "Ġsmall": 917,
      "\"Ċ": 918,
      ",Ċ": 919,
      "its": 920,
      "Ġlar": 921,
      "xed": 922,
      "tal": 923,
      "erv": 924,
      "Ġrem": 925,
      "100": 926,
      "Ġwhen": 927,
      "Ġrel": 928,
      "ode": 929,
      "Ġfact": 930,
      "Ġappro": 931,
      "Ġ}": 932,
      "Ġinde": 933,
      "Ġinto": 934,
      "ait": 935,
      "math": 936,
      "Ġele": 937,
      "Ġcheck": 938,
      "ption": 939,
      "ides": 940,
      "stem": 941,
      "Let": 942,
      "Ġcomm": 943,
      "ange": 944,
      "ating": 945,
      "ĠQ": 946,
      "rib": 947,
      "Ġtrans": 948,
      "ĠâĢ": 949,
      "Ġdire": 950,
      "Ġsame": 951,
      "ĠĠĠĠĊ": 952,
      "ify": 953,
      "Ġbecause": 954,
      "âĪļ": 955,
      "_start": 956,
      "Ġrequ": 957,
      "_end": 958,
      "Ġtime": 959,
      "Ġthem": 960,
      "com": 961,
      "cal": 962,
      "cent": 963,
      "Ġq": 964,
      "ild": 965,
      "In": 966,
      "und": 967,
      "out": 968,
      "Ġconsider": 969,
      "ta": 970,
      "xim": 971,
      "Ġph": 972,
      "Ġcould": 973,
      "Ġfirst": 974,
      "âĢĻs": 975,
      "Ġcent": 976,
      "(n": 977,
      ").ĊĊ": 978,
      "ind": 979,
      "ci": 980,
      "ility": 981,
      "Ġinteger": 982,
      "Ġty": 983,
      "ational": 984,
      "Ġlength": 985,
      "Ġinters": 986,
      "200": 987,
      "op": 988,
      "ower": 989,
      ")$": 990,
      "Ġnumbers": 991,
      "Ġthese": 992,
      "fter": 993,
      "row": 994,
      "not": 995,
      "Ġprov": 996,
      "Ġself": 997,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 998,
      "ines": 999,
      "owever": 1000,
      "oint": 1001,
      "24": 1002,
      "ĠÎ±": 1003,
      "val": 1004,
      "Ġ(-": 1005,
      "Ġtry": 1006,
      "Ġmight": 1007,
      "}\\": 1008,
      "ss": 1009,
      "Ġvert": 1010,
      "dd": 1011,
      "Ġob": 1012,
      "',": 1013,
      "17": 1014,
      "):Ċ": 1015,
      "ality": 1016,
      "ĠCon": 1017,
      "Ġnon": 1018,
      "ne": 1019,
      "Ġresult": 1020,
      "Ġâī¤": 1021,
      "--------": 1022,
      "ero": 1023,
      "pro": 1024,
      "Ġmost": 1025,
      "Ġexam": 1026,
      "Ġcount": 1027,
      "Ġright": 1028,
      "Ġbound": 1029,
      "Ġget": 1030,
      "app": 1031,
      "get": 1032,
      "yth": 1033,
      "hes": 1034,
      "Ġwere": 1035,
      "pon": 1036,
      "30": 1037,
      "olog": 1038,
      "since": 1039,
      "Ġgener": 1040,
      "Ġpossible": 1041,
      "'t": 1042,
      "ful": 1043,
      "aps": 1044,
      "Ġnew": 1045,
      "Ġem": 1046,
      "Ġyour": 1047,
      "ĠBC": 1048,
      "ĠIt": 1049,
      "Ġass": 1050,
      "Ġag": 1051,
      "ÏĢ": 1052,
      "Ġdet": 1053,
      "Ġcomple": 1054,
      "Ġchar": 1055,
      "Ġproduct": 1056,
      "ields": 1057,
      "ffect": 1058,
      "ish": 1059,
      "Ġthree": 1060,
      "ude": 1061,
      "ething": 1062,
      "omething": 1063,
      "ics": 1064,
      "ĠAn": 1065,
      "Ġtra": 1066,
      "ber": 1067,
      "Ġ>=": 1068,
      "Ġdes": 1069,
      "Ġpair": 1070,
      "vers": 1071,
      "resent": 1072,
      "Ġdoes": 1073,
      "ĠCom": 1074,
      "hed": 1075,
      "Ġexact": 1076,
      "ities": 1077,
      "Ġgra": 1078,
      "rit": 1079,
      "Ġsystem": 1080,
      "ian": 1081,
      ":**": 1082,
      "Ġeven": 1083,
      "Ġab": 1084,
      "36": 1085,
      "Ġunder": 1086,
      "arly": 1087,
      "fore": 1088,
      "```": 1089,
      "ty": 1090,
      "ency": 1091,
      "Ġtest": 1092,
      "Ġdifferent": 1093,
      "hen": 1094,
      "sqrt": 1095,
      "Ġclass": 1096,
      "Ġpositive": 1097,
      "Ġmult": 1098,
      "Ġsign": 1099,
      "^{-": 1100,
      ")(": 1101,
      "Ġwho": 1102,
      "Ġvari": 1103,
      "ost": 1104,
      "Ġcur": 1105,
      "ie": 1106,
      "Ġhis": 1107,
      "Ġmany": 1108,
      "ron": 1109,
      "ists": 1110,
      "ĠCh": 1111,
      "Ġwant": 1112,
      "Ġext": 1113,
      "Ġminim": 1114,
      "ror": 1115,
      "Ġam": 1116,
      "$,": 1117,
      "ough": 1118,
      "Al": 1119,
      "ĠHowever": 1120,
      "Ġstud": 1121,
      "inal": 1122,
      "ically": 1123,
      "Ġcircle": 1124,
      "Ġwork": 1125,
      "000": 1126,
      "ract": 1127,
      "(s": 1128,
      "ization": 1129,
      "Ġorder": 1130,
      "io": 1131,
      "reat": 1132,
      "lock": 1133,
      "Ġve": 1134,
      "gy": 1135,
      "ood": 1136,
      "Ġins": 1137,
      "gative": 1138,
      "pos": 1139,
      "Ġgiven": 1140,
      "__": 1141,
      "ĠWe": 1142,
      "Ġinf": 1143,
      "ffic": 1144,
      "ined": 1145,
      "Ġknown": 1146,
      "cd": 1147,
      "Ġspecific": 1148,
      "read": 1149,
      "Ġsat": 1150,
      "Ġtotal": 1151,
      "...": 1152,
      "]Ċ": 1153,
      "ible": 1154,
      "{\\": 1155,
      "Ġsomething": 1156,
      "ĠRe": 1157,
      "(\\": 1158,
      "ings": 1159,
      "Ġafter": 1160,
      "ior": 1161,
      ")ĊĊ": 1162,
      "ython": 1163,
      "Ġke": 1164,
      "ced": 1165,
      "rent": 1166,
      "Ġsa": 1167,
      "Ġcre": 1168,
      "ert": 1169,
      "Ġvalue": 1170,
      "Ġpe": 1171,
      "ross": 1172,
      "Ġstate": 1173,
      "Ġterms": 1174,
      "ctor": 1175,
      "Ġinclud": 1176,
      "vel": 1177,
      "*(": 1178,
      "ased": 1179,
      "ute": 1180,
      "Ġinv": 1181,
      "Ġfinal": 1182,
      "ident": 1183,
      "cept": 1184,
      "[Ċ": 1185,
      "Ġbo": 1186,
      "ges": 1187,
      "Ġ->": 1188,
      "ention": 1189,
      "cture": 1190,
      "lic": 1191,
      "201": 1192,
      "Ġleft": 1193,
      "Ġint": 1194,
      "isf": 1195,
      "Ġequation": 1196,
      "Ġused": 1197,
      "Ġden": 1198,
      ")=": 1199,
      "27": 1200,
      "ib": 1201,
      "ears": 1202,
      "Ġexactly": 1203,
      "50": 1204,
      "()": 1205,
      "Ġend": 1206,
      "Ġlog": 1207,
      "\\)": 1208,
      "Ġyields": 1209,
      "Ġcontain": 1210,
      "ism": 1211,
      "60": 1212,
      "Ġadd": 1213,
      "Ġrat": 1214,
      "met": 1215,
      "Ġsatisf": 1216,
      "ĨĴ": 1217,
      "Ġthink": 1218,
      "plic": 1219,
      "Ġdistance": 1220,
      "Ġinteg": 1221,
      "ec": 1222,
      "40": 1223,
      "ases": 1224,
      "Ġincre": 1225,
      "ĠUn": 1226,
      "Ġ{Ċ": 1227,
      "Ġent": 1228,
      "28": 1229,
      "set": 1230,
      "rite": 1231,
      "Ġvertices": 1232,
      "Ġind": 1233,
      "ternative": 1234,
      "ĠAl": 1235,
      "):": 1236,
      "haps": 1237,
      "Ġcorre": 1238,
      "point": 1239,
      "Ġvalues": 1240,
      "ures": 1241,
      "omin": 1242,
      "33": 1243,
      ").Ċ": 1244,
      "Ġsym": 1245,
      "Ġsquare": 1246,
      "ives": 1247,
      "cul": 1248,
      "Ġodd": 1249,
      "âĢĿ": 1250,
      "Ġâī¡": 1251,
      "Ġimport": 1252,
      "Ġequal": 1253,
      "Ġpat": 1254,
      "Ġel": 1255,
      "boxed": 1256,
      "Ġcannot": 1257,
      "old": 1258,
      "(t": 1259,
      "co": 1260,
      "ĠWait": 1261,
      "Ġstring": 1262,
      "ake": 1263,
      "ĠPro": 1264,
      "ves": 1265,
      "Ġleast": 1266,
      "ral": 1267,
      "ick": 1268,
      "equ": 1269,
      "Ġhad": 1270,
      "Ġsur": 1271,
      "Ġstr": 1272,
      "ual": 1273,
      "ied": 1274,
      "Ġarea": 1275,
      "Ġregion": 1276,
      "}}": 1277,
      "Ġjust": 1278,
      "Ġorig": 1279,
      "round": 1280,
      "Ġprocess": 1281,
      "raint": 1282,
      "ized": 1283,
      "-b": 1284,
      "user": 1285,
      "ex": 1286,
      "ning": 1287,
      "Ġstru": 1288,
      "Ġconf": 1289,
      "Ġsee": 1290,
      "Ġfactor": 1291,
      "Ġpass": 1292,
      "32": 1293,
      "Ġdata": 1294,
      "icular": 1295,
      "up": 1296,
      "Ġrep": 1297,
      "arch": 1298,
      "mathb": 1299,
      "Ġuser": 1300,
      "Î¸": 1301,
      "Ġlet": 1302,
      "Ġfe": 1303,
      "Ġhand": 1304,
      "pect": 1305,
      "$$": 1306,
      "vi": 1307,
      "Ġlarge": 1308,
      "Ġcase": 1309,
      "right": 1310,
      "mod": 1311,
      "Ġder": 1312,
      "Ġwhat": 1313,
      "Ġbeen": 1314,
      "Ġdivis": 1315,
      "ctions": 1316,
      "line": 1317,
      "Ġzero": 1318,
      "========": 1319,
      "Ġrow": 1320,
      "Ġinst": 1321,
      "Ġmaxim": 1322,
      "Ġmulti": 1323,
      "Ġhow": 1324,
      "ople": 1325,
      "ons": 1326,
      "here": 1327,
      "cond": 1328,
      "ature": 1329,
      "]ĊĊ": 1330,
      "-s": 1331,
      "Ġsize": 1332,
      "ĠNot": 1333,
      "Ġear": 1334,
      "ethod": 1335,
      "tex": 1336,
      "Ġthose": 1337,
      "fficient": 1338,
      "ĠAC": 1339,
      "ĠâĪļ": 1340,
      "Ġstep": 1341,
      "Ġremain": 1342,
      "90": 1343,
      "uring": 1344,
      "ield": 1345,
      "Ġtyp": 1346,
      "formation": 1347,
      "istant": 1348,
      "par": 1349,
      "yn": 1350,
      "64": 1351,
      "Ġnegative": 1352,
      "}.": 1353,
      "Ġhel": 1354,
      "ved": 1355,
      "\",": 1356,
      "aw": 1357,
      "estion": 1358,
      "Ġopp": 1359,
      "Ġconstant": 1360,
      "Ġshow": 1361,
      "ane": 1362,
      "cos": 1363,
      "lect": 1364,
      "lop": 1365,
      "Ġflo": 1366,
      "mer": 1367,
      "ĠInde": 1368,
      "Ġdig": 1369,
      "Ġhigh": 1370,
      "ef": 1371,
      "Ġgrou": 1372,
      "ĠâĪĪ": 1373,
      "Ġprint": 1374,
      "inct": 1375,
      "ression": 1376,
      "king": 1377,
      "Ġour": 1378,
      "ĠEx": 1379,
      "âĶ": 1380,
      "ten": 1381,
      "log": 1382,
      "ĠĠĠĠĠĠĠĠĊ": 1383,
      "(y": 1384,
      "Ġreal": 1385,
      "iqu": 1386,
      "Ġallow": 1387,
      "Ġredu": 1388,
      "Ġcall": 1389,
      "(a": 1390,
      "oc": 1391,
      "atic": 1392,
      "Ġconstraint": 1393,
      "Ġperhaps": 1394,
      "(\"": 1395,
      "ordin": 1396,
      "Ġless": 1397,
      "Ġer": 1398,
      "Ġvertex": 1399,
      "ually": 1400,
      "ters": 1401,
      "Ġfl": 1402,
      "Ġsides": 1403,
      "alcul": 1404,
      "99": 1405,
      "Ġrequire": 1406,
      "Ġdeg": 1407,
      "Alternative": 1408,
      "ark": 1409,
      "Ġeffect": 1410,
      "Ġpeople": 1411,
      "uc": 1412,
      "umn": 1413,
      "ward": 1414,
      "uth": 1415,
      "Ġoper": 1416,
      "ting": 1417,
      "22": 1418,
      "Ġdirect": 1419,
      "Ġatt": 1420,
      "ĠâĢľ": 1421,
      "_c": 1422,
      "Ġ<=": 1423,
      "Ġrec": 1424,
      "ner": 1425,
      "ension": 1426,
      "Ġroot": 1427,
      "ural": 1428,
      "cdot": 1429,
      "(f": 1430,
      "ĠâĨĴ": 1431,
      "ull": 1432,
      "gg": 1433,
      "ability": 1434,
      "ples": 1435,
      "Ġmon": 1436,
      "ares": 1437,
      "ins": 1438,
      "Ġpoly": 1439,
      "45": 1440,
      "Alternatively": 1441,
      "Ġdistinct": 1442,
      "Ġsupp": 1443,
      "Ġfol": 1444,
      "very": 1445,
      "Ġ\"\"": 1446,
      "omet": 1447,
      "Ġbu": 1448,
      "hat": 1449,
      "St": 1450,
      "Ġstart": 1451,
      "\")Ċ": 1452,
      "tep": 1453,
      "ix": 1454,
      "Î±": 1455,
      "ĠOr": 1456,
      "Ġfound": 1457,
      "ĠÏĨ": 1458,
      "Ġwhile": 1459,
      "âĢĳ": 1460,
      "Ġradi": 1461,
      "})": 1462,
      "Ġproper": 1463,
      "ape": 1464,
      "Ġprog": 1465,
      "-c": 1466,
      "ving": 1467,
      "Ġmodel": 1468,
      "onal": 1469,
      "velop": 1470,
      "}Ċ": 1471,
      "Ġmake": 1472,
      "_t": 1473,
      "Ġquestion": 1474,
      "Ġoff": 1475,
      "Ġlines": 1476,
      "assistant": 1477,
      "osite": 1478,
      "HS": 1479,
      "ĠZ": 1480,
      "Ġbl": 1481,
      "think": 1482,
      "âĶĢ": 1483,
      "ĠÎ¸": 1484,
      "Ġchild": 1485,
      "Ġmem": 1486,
      "26": 1487,
      "ited": 1488,
      "Ġet": 1489,
      "pi": 1490,
      "pr": 1491,
      "ork": 1492,
      "Ġblock": 1493,
      "Ġ&": 1494,
      "Ġexample": 1495,
      "Ġcell": 1496,
      "Ġback": 1497,
      "Ġposition": 1498,
      "_k": 1499,
      "adr": 1500,
      "Ġcharact": 1501,
      "_s": 1502,
      ",b": 1503,
      "pre": 1504,
      "Ġintersect": 1505,
      "\\[Ċ": 1506,
      "Ġknow": 1507,
      "Ġref": 1508,
      "Ġhelp": 1509,
      "Ġintersection": 1510,
      "Ġpol": 1511,
      "Ġav": 1512,
      "Ġcode": 1513,
      "ences": 1514,
      "75": 1515,
      "ĠNo": 1516,
      "oid": 1517,
      ")/(": 1518,
      "21": 1519,
      "Ġdec": 1520,
      "sin": 1521,
      "Ġwithin": 1522,
      "ness": 1523,
      "uch": 1524,
      "ptim": 1525,
      "Ġact": 1526,
      "Ġcorrect": 1527,
      "Ġmethod": 1528,
      "alth": 1529,
      "ĠThere": 1530,
      "Ġconn": 1531,
      "23": 1532,
      ".\"": 1533,
      "Ġsecond": 1534,
      "Ġderiv": 1535,
      "Ġlim": 1536,
      "Ġcare": 1537,
      "Ġinc": 1538,
      "ĠHe": 1539,
      "66": 1540,
      "Ġfollow": 1541,
      "Ġwell": 1542,
      "ts": 1543,
      "Ġmid": 1544,
      "ential": 1545,
      "Ġcho": 1546,
      "ĠIndeed": 1547,
      "Ġ)": 1548,
      "Ġratio": 1549,
      "ob": 1550,
      "Ġcar": 1551,
      "_j": 1552,
      "Ġident": 1553,
      "sing": 1554,
      "amet": 1555,
      "ĠâĪł": 1556,
      "Ġlist": 1557,
      "ages": 1558,
      "Ġedges": 1559,
      "Ġquadr": 1560,
      "Com": 1561,
      "chn": 1562,
      "Ġcenter": 1563,
      ">Ċ": 1564,
      "},": 1565,
      "Ġsquares": 1566,
      "ĠEn": 1567,
      "ĠÎ²": 1568,
      "Ġnumer": 1569,
      "ax": 1570,
      "Ġsequ": 1571,
      "Ġdepend": 1572,
      "Ġcontin": 1573,
      "py": 1574,
      "Ġapproach": 1575,
      "Ġoc": 1576,
      "sib": 1577,
      "Ġcomb": 1578,
      "Ġcolumn": 1579,
      "Ġstand": 1580,
      "80": 1581,
      "(-": 1582,
      "alle": 1583,
      "min": 1584,
      "ug": 1585,
      "+b": 1586,
      "Ġpath": 1587,
      "Ġcurrent": 1588,
      "ily": 1589,
      "Ġcy": 1590,
      "Ġdiag": 1591,
      "less": 1592,
      "This": 1593,
      "tem": 1594,
      "hem": 1595,
      "29": 1596,
      "Ġener": 1597,
      "Ġearli": 1598,
      "Ġlead": 1599,
      "Ġ//": 1600,
      "Ġagain": 1601,
      "Ġinterior": 1602,
      "âĶĢâĶĢ": 1603,
      "Ġpattern": 1604,
      "Ġgraph": 1605,
      "Ġcoordin": 1606,
      "Ġdevelop": 1607,
      "ĠAD": 1608,
      "35": 1609,
      "Ġtop": 1610,
      "Ġanal": 1611,
      "ology": 1612,
      "Ġsymmet": 1613,
      "_d": 1614,
      "ted": 1615,
      "Ġdeterm": 1616,
      "Ġacc": 1617,
      "Ġrepresent": 1618,
      "Ġbefore": 1619,
      "Ġarg": 1620,
      "Ġopposite": 1621,
      "Ġmaximum": 1622,
      "Ġdown": 1623,
      "}^{": 1624,
      "Ġmeas": 1625,
      "For": 1626,
      "Ġstructure": 1627,
      "for": 1628,
      "plement": 1629,
      "###": 1630,
      "Ġearlier": 1631,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1632,
      "ÃĹ": 1633,
      "imil": 1634,
      "Ġcle": 1635,
      "cri": 1636,
      ");Ċ": 1637,
      "Ġadj": 1638,
      "Ġens": 1639,
      "Ġsolutions": 1640,
      "iod": 1641,
      "Ġfloor": 1642,
      "Ġgu": 1643,
      "Ġsatisfy": 1644,
      "Ġprovide": 1645,
      "\".": 1646,
      "ool": 1647,
      "ote": 1648,
      "Ġcommon": 1649,
      "ominator": 1650,
      "Ġprime": 1651,
      "Ġoriginal": 1652,
      "Ġpower": 1653,
      "_A": 1654,
      "_{\\": 1655,
      "Ġenergy": 1656,
      "Ġbase": 1657,
      "Ġexist": 1658,
      "ĠAt": 1659,
      "Ġelse": 1660,
      "ially": 1661,
      "ants": 1662,
      "Ġpers": 1663,
      "ade": 1664,
      "ublic": 1665,
      "Ġtang": 1666,
      "ven": 1667,
      "_p": 1668,
      "ars": 1669,
      "gan": 1670,
      "olds": 1671,
      "Ġlower": 1672,
      "Â°,": 1673,
      "pendicular": 1674,
      "Ġbeing": 1675,
      "Ġyears": 1676,
      "Ġlook": 1677,
      ".g": 1678,
      "Ġhy": 1679,
      "Ġmet": 1680,
      "ĠÏĢ": 1681,
      "ances": 1682,
      "Ġformul": 1683,
      "ches": 1684,
      "Ġwater": 1685,
      "verse": 1686,
      "Ġread": 1687,
      "}(": 1688,
      "Ġinput": 1689,
      "Ġsimil": 1690,
      "Ġway": 1691,
      "('": 1692,
      "ems": 1693,
      "ision": 1694,
      "other": 1695,
      "sum": 1696,
      "asing": 1697,
      "cles": 1698,
      "Ġacross": 1699,
      "wn": 1700,
      "Ġoutput": 1701,
      "Ġmed": 1702,
      "ither": 1703,
      "eps": 1704,
      "ray": 1705,
      "wh": 1706,
      "Ġspace": 1707,
      "aces": 1708,
      "ton": 1709,
      "left": 1710,
      "arily": 1711,
      "Ġscal": 1712,
      "48": 1713,
      "ique": 1714,
      "ier": 1715,
      "ern": 1716,
      "Ġsing": 1717,
      "Ġser": 1718,
      "Ġmeans": 1719,
      "olution": 1720,
      "\\]ĊĊ": 1721,
      "part": 1722,
      "Ġvi": 1723,
      "Ġcover": 1724,
      "Ġperpendicular": 1725,
      "Ġconstraints": 1726,
      "ration": 1727,
      "ateral": 1728,
      "Ġincludes": 1729,
      "pha": 1730,
      "Ġprogram": 1731,
      "Ġcalcul": 1732,
      "}^": 1733,
      "Con": 1734,
      "led": 1735,
      "ument": 1736,
      "times": 1737,
      "Ġdirection": 1738,
      "ume": 1739,
      "^n": 1740,
      "Ġmis": 1741,
      "Ġgroup": 1742,
      "ĠÎ»": 1743,
      "Ġconstru": 1744,
      "Ġinequ": 1745,
      "ification": 1746,
      "vent": 1747,
      "Ġindeed": 1748,
      "ĠAs": 1749,
      "ribution": 1750,
      "199": 1751,
      "Ġcomplex": 1752,
      "Ġ}Ċ": 1753,
      "Ġfour": 1754,
      "apt": 1755,
      "ixed": 1756,
      ")^{": 1757,
      "If": 1758,
      "-d": 1759,
      "ife": 1760,
      "Ġindex": 1761,
      "Ġinformation": 1762,
      "imilarly": 1763,
      "Ġobject": 1764,
      "onent": 1765,
      "Ġedge": 1766,
      "Ġtype": 1767,
      ":**Ċ": 1768,
      "Ġtimes": 1769,
      "Ġfam": 1770,
      "()Ċ": 1771,
      "Â·": 1772,
      "Ġâī¥": 1773,
      "Ġabove": 1774,
      "Ġpairs": 1775,
      "ivers": 1776,
      "Ġexpression": 1777,
      "mathbf": 1778,
      "Ġ:": 1779,
      "omial": 1780,
      "ircle": 1781,
      "meric": 1782,
      "inite": 1783,
      "Ġarc": 1784,
      "Ġlong": 1785,
      "omes": 1786,
      "Ġlevel": 1787,
      "Ġpres": 1788,
      "Ġwrite": 1789,
      "-f": 1790,
      "Ġinclude": 1791,
      "ond": 1792,
      "Ġsimilar": 1793,
      "ilateral": 1794,
      ".<|": 1795,
      "elta": 1796,
      "Ġetc": 1797,
      "Ġshe": 1798,
      "ĠUse": 1799,
      "Ġtechn": 1800,
      "Ġminimal": 1801,
      "49": 1802,
      "37": 1803,
      "Ġwithout": 1804,
      "AB": 1805,
      "efficient": 1806,
      "red": 1807,
      "ĠĠĊ": 1808,
      "order": 1809,
      "65": 1810,
      "ified": 1811,
      "ivity": 1812,
      "(self": 1813,
      "Ġelect": 1814,
      "rid": 1815,
      "?Ċ": 1816,
      "Ġmean": 1817,
      "Ġnecess": 1818,
      "Ġfail": 1819,
      "bit": 1820,
      "iron": 1821,
      ")}": 1822,
      "Ġbre": 1823,
      "allel": 1824,
      "ected": 1825,
      "of": 1826,
      "Ġtem": 1827,
      "ways": 1828,
      "Ġkey": 1829,
      "ling": 1830,
      "Ġsays": 1831,
      "ym": 1832,
      "Ġsolve": 1833,
      "Ġsaid": 1834,
      "Ġge": 1835,
      "Ġrest": 1836,
      "Ġperiod": 1837,
      ")).": 1838,
      "raph": 1839,
      "land": 1840,
      "Ġcomput": 1841,
      "Ġshape": 1842,
      "ĠThey": 1843,
      "str": 1844,
      "face": 1845,
      "ĠâĦ": 1846,
      "ey": 1847,
      "amb": 1848,
      "gor": 1849,
      "arm": 1850,
      "alf": 1851,
      "Ġlikely": 1852,
      "respon": 1853,
      "ask": 1854,
      "((": 1855,
      "ets": 1856,
      "itude": 1857,
      "âĢĶ": 1858,
      "Ġdenominator": 1859,
      "Ġexpress": 1860,
      "Ġtreat": 1861,
      "Ġstill": 1862,
      "Ġseg": 1863,
      "ash": 1864,
      "Ġmax": 1865,
      "70": 1866,
      "pper": 1867,
      "els": 1868,
      "'ll": 1869,
      "Ġrespon": 1870,
      "Ġlinear": 1871,
      "âī": 1872,
      "Ġfield": 1873,
      "ety": 1874,
      "Ġrange": 1875,
      "Ġinside": 1876,
      "alpha": 1877,
      "ĠCD": 1878,
      "Ġvector": 1879,
      "Ġeither": 1880,
      "Ġrese": 1881,
      "Ġduring": 1882,
      "ests": 1883,
      "Ġinequality": 1884,
      "gs": 1885,
      "Ġworks": 1886,
      "Ġprob": 1887,
      "ĠAr": 1888,
      "ector": 1889,
      "Ġplay": 1890,
      ")*(": 1891,
      "ulation": 1892,
      "ormal": 1893,
      "ries": 1894,
      "Ġpresent": 1895,
      "Ġdra": 1896,
      "ĠAmeric": 1897,
      "Ġevery": 1898,
      "Ġtak": 1899,
      "ination": 1900,
      "Ġ==": 1901,
      "cial": 1902,
      "**:Ċ": 1903,
      "rans": 1904,
      "Ġvery": 1905,
      "```ĊĊ": 1906,
      "ody": 1907,
      "Ġoptim": 1908,
      "ĠSh": 1909,
      "Ġexpl": 1910,
      "ank": 1911,
      "Â±": 1912,
      "over": 1913,
      "Ġgrow": 1914,
      "ott": 1915,
      "----------------": 1916,
      "rror": 1917,
      "Given": 1918,
      "rix": 1919,
      "Ġsl": 1920,
      "34": 1921,
      "Ġmove": 1922,
      "python": 1923,
      "imension": 1924,
      "me": 1925,
      "ĠPython": 1926,
      "Ġher": 1927,
      "oriz": 1928,
      "def": 1929,
      "Ġcharacter": 1930,
      "</": 1931,
      "Ġexper": 1932,
      "ule": 1933,
      "$Ċ": 1934,
      "Ġstandard": 1935,
      "curs": 1936,
      "ource": 1937,
      "iply": 1938,
      "Ġplace": 1939,
      "Ġdou": 1940,
      "rict": 1941,
      "_f": 1942,
      "Ġexists": 1943,
      "Ġvia": 1944,
      "Ġsequence": 1945,
      "Ġsk": 1946,
      "Ġverify": 1947,
      "ables": 1948,
      "ason": 1949,
      "}.ĊĊ": 1950,
      "Ġmeasure": 1951,
      "Ġformula": 1952,
      "Ġdivisible": 1953,
      "requ": 1954,
      "ards": 1955,
      "Ġradius": 1956,
      "viron": 1957,
      "Ġchang": 1958,
      "like": 1959,
      "Ġgives": 1960,
      "ided": 1961,
      "ĠĠĠĠĠĠĠĠĠĠĠĠ": 1962,
      "Ġmention": 1963,
      "da": 1964,
      "Ġweight": 1965,
      "Ġgood": 1966,
      "ift": 1967,
      "ival": 1968,
      "iles": 1969,
      "Ġbecomes": 1970,
      "Ġdisc": 1971,
      "ions": 1972,
      "tle": 1973,
      "orizon": 1974,
      "ately": 1975,
      "Ġphys": 1976,
      "Ġbis": 1977,
      "ires": 1978,
      "chool": 1979,
      "ready": 1980,
      "Ġdegree": 1981,
      "Ġ\"\"\"Ċ": 1982,
      "ho": 1983,
      "alse": 1984,
      "44": 1985,
      "Ġoften": 1986,
      "Ġcoefficient": 1987,
      "ĠÃĹ": 1988,
      "Ġname": 1989,
      "Ġlear": 1990,
      "itial": 1991,
      "ĠAnd": 1992,
      "Ġcareful": 1993,
      "Ġaround": 1994,
      "(p": 1995,
      "mathcal": 1996,
      "':": 1997,
      "where": 1998,
      "Ġrun": 1999,
      "stand": 2000,
      "ample": 2001,
      "Ġest": 2002,
      "way": 2003,
      "Ġgeneral": 2004,
      ",c": 2005,
      "gn": 2006,
      "],": 2007,
      "hip": 2008,
      "any": 2009,
      "Ġvis": 2010,
      "ared": 2011,
      "Ġsupport": 2012,
      "38": 2013,
      "180": 2014,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2015,
      "Ġholds": 2016,
      "Ġtext": 2017,
      "_id": 2018,
      "Ġdon": 2019,
      "nomial": 2020,
      "Ġperm": 2021,
      "ĠIm": 2022,
      "Ġlast": 2023,
      "Ġart": 2024,
      "Ġalways": 2025,
      "sc": 2026,
      "Ġhum": 2027,
      "Ġhalf": 2028,
      "Ġcontro": 2029,
      "ĠNew": 2030,
      "pendent": 2031,
      "Ġspe": 2032,
      "cle": 2033,
      "Ġop": 2034,
      "gin": 2035,
      "Ġsingle": 2036,
      "Ġelements": 2037,
      "Ġimplement": 2038,
      "Ġerror": 2039,
      "Ġparallel": 2040,
      "_b": 2041,
      "name": 2042,
      ",\\": 2043,
      "Ġadjac": 2044,
      "Ġgre": 2045,
      "mon": 2046,
      "Ġtake": 2047,
      "lection": 2048,
      "aybe": 2049,
      "Ġconver": 2050,
      "Ġ...": 2051,
      "angles": 2052,
      "wise": 2053,
      "Ġdid": 2054,
      "---": 2055,
      "Ġhealth": 2056,
      "nal": 2057,
      "uration": 2058,
      "self": 2059,
      "ining": 2060,
      "=\"": 2061,
      "Ġnear": 2062,
      "Ġcorrespon": 2063,
      ",y": 2064,
      "vex": 2065,
      "Ġinvol": 2066,
      "Ġlarger": 2067,
      "pty": 2068,
      "Ġpri": 2069,
      "aren": 2070,
      "Ġworld": 2071,
      "So": 2072,
      "**Ċ": 2073,
      "ler": 2074,
      "max": 2075,
      "Ġln": 2076,
      "ĠĠĠĠĠ": 2077,
      "rue": 2078,
      "Ġrect": 2079,
      "Ġstudents": 2080,
      "istic": 2081,
      "ĠCompute": 2082,
      "iding": 2083,
      "Ġintegers": 2084,
      "Ġlocal": 2085,
      "(A": 2086,
      "Pro": 2087,
      "Ġangles": 2088,
      "Ġpolynomial": 2089,
      "Ġdigits": 2090,
      "ER": 2091,
      "Ġconfig": 2092,
      "Ġ~": 2093,
      "atch": 2094,
      "pot": 2095,
      "ators": 2096,
      "ference": 2097,
      "Ġsugg": 2098,
      "Ġbeh": 2099,
      "(b": 2100,
      "Ġmultiple": 2101,
      "ĠRes": 2102,
      "39": 2103,
      "Ġcolor": 2104,
      "ĠYes": 2105,
      "Ġmuch": 2106,
      "Ġremo": 2107,
      "Ġsubset": 2108,
      "Ġlimit": 2109,
      "ighb": 2110,
      "Ġapproxim": 2111,
      "Step": 2112,
      "ense": 2113,
      "Ġ\\)": 2114,
      "ysis": 2115,
      "eta": 2116,
      "Ġcells": 2117,
      "Ġelement": 2118,
      "Ġrot": 2119,
      "bal": 2120,
      "Ġdesign": 2121,
      "Ġchange": 2122,
      "Ġmade": 2123,
      "Ġdifference": 2124,
      "Ġunique": 2125,
      "Ġlies": 2126,
      "Ġpot": 2127,
      "ĠABC": 2128,
      "}=": 2129,
      "cer": 2130,
      "ead": 2131,
      "au": 2132,
      "ird": 2133,
      "Ġmodul": 2134,
      "Ġalong": 2135,
      "-t": 2136,
      "Ġvalid": 2137,
      "Ġvs": 2138,
      "Ġcommun": 2139,
      "igma": 2140,
      "Ġpublic": 2141,
      "Ġhig": 2142,
      "usion": 2143,
      "col": 2144,
      "loc": 2145,
      "Ġimp": 2146,
      "Ġplan": 2147,
      "Ġcircum": 2148,
      "Ġquant": 2149,
      "Ġnow": 2150,
      "ser": 2151,
      "Ġproduce": 2152,
      "Ġuses": 2153,
      "theta": 2154,
      "ithm": 2155,
      "Ġchildren": 2156,
      "Error": 2157,
      "answer": 2158,
      "Ġfixed": 2159,
      "Ġtan": 2160,
      "Ġprec": 2161,
      "$.": 2162,
      "56": 2163,
      "etic": 2164,
      "_x": 2165,
      "rop": 2166,
      "Ġpop": 2167,
      "stit": 2168,
      "Ġ%": 2169,
      "Ġmass": 2170,
      "Ġsymmetric": 2171,
      "Ġtheore": 2172,
      "oss": 2173,
      "ambda": 2174,
      "pping": 2175,
      "med": 2176,
      ")\\": 2177,
      "Ġcontinu": 2178,
      "chan": 2179,
      "Ġcalled": 2180,
      "son": 2181,
      "Ġamong": 2182,
      "Ġvol": 2183,
      "================": 2184,
      "ga": 2185,
      "Ġyear": 2186,
      "Ġparamet": 2187,
      "quad": 2188,
      "ames": 2189,
      "Ġlab": 2190,
      "31": 2191,
      "ively": 2192,
      "ene": 2193,
      "Ġfunctions": 2194,
      "'Ċ": 2195,
      "Ġrespect": 2196,
      "Ġcomplete": 2197,
      "Ġunit": 2198,
      "_B": 2199,
      "Ġbased": 2200,
      "duct": 2201,
      "Ġmatch": 2202,
      "side": 2203,
      "Ġpossib": 2204,
      "Ġ.": 2205,
      "Ex": 2206,
      "Ġdefine": 2207,
      "arget": 2208,
      "Ġabs": 2209,
      "Ġown": 2210,
      "Ġrational": 2211,
      "Ġsepar": 2212,
      "serv": 2213,
      "vironment": 2214,
      "raction": 2215,
      "Ġserv": 2216,
      "Ġsw": 2217,
      "Ġnumerator": 2218,
      "$.ĊĊ": 2219,
      "Ġsince": 2220,
